{"data":{"page":{"title":"How do (encrypted) mnemonic phrases work?","slug":"general-knowledge/cryptography/how-do-mnemonic-phrases-work","originalSlug":"general-knowledge/cryptography/how-do-mnemonic-phrases-work","description":"Private Keys & Passwords","datePublished":"2018-06-20","dateModified":"2018-12-19","parent":{"__typename":"Category","title":"Cryptography & Encryption"},"breadcrumbs":[{"title":"General Knowledge","slug":"general-knowledge"},{"title":"Cryptography & Encryption","slug":"general-knowledge/cryptography"},{"title":"How do (encrypted) mnemonic phrases work?","slug":"general-knowledge/cryptography/how-do-mnemonic-phrases-work"}]},"file":{"childMarkdownRemark":{"html":"<p>A <strong>mnemonic phrase</strong> or <strong>mnemonic seed</strong> is a set of typically either 12 or 24 words, which can be used to derive an infinite number of wallets. Often times these phrases are used by cryptocurrency hardware wallets, to be written down on a piece of paper by the user to safely back up the users' funds.</p>\n<p>Sometimes these are referred to as <em>backup phrases</em> or <em>seed phrases</em> or <em>12-word phrase</em> by other wallets or interfaces.</p>\n<p>In the Ethereum ecosystem, mnemonic phrases are generally generated following the <a href=\"https://github.com/bitcoin/bips/blob/master/bip-0032.mediawiki\" target=\"_blank\" rel=\"noopener noreferrer\">BIP 32</a> spec. Popular hardware wallets, like Ledger and TREZOR, follow this spec, same applies to MetaMask. The mnemonic phrase generated by your wallet (usually) consists of 24 words, randomly selected from the <a href=\"https://github.com/bitcoin/bips/blob/master/bip-0039/english.txt\" target=\"_blank\" rel=\"noopener noreferrer\">BIP 32 English wordlist</a>, some wallets make use of a 12-word mnemonic phrase that are shorter and therefore easier to remember.</p>\n<h2>Encrypted mnemonic phrases</h2>\n<p>Many wallets provide an option to encrypt your mnemonic phrase with a password. This is useful as accessing your wallets would require you to have <em>something you have</em> (the mnemonic phrase) plus <em>something you know</em> (the password). Often times this is referred to as <strong>13th/25th word/seed</strong>.</p>\n<p>However there are some key differences between a typical password and the password that protects your mnemonic phrase. Because the password doesn't encrypt the mnemonic phrase (like the password encrypts your keystore file), there is no \"wrong\" password. This can be known as a \"plausible deniability\" passphrase.</p>\n<h3>Plausible deniability</h3>\n<p>Since every password generates a valid seed and will unlock a different account, there is no \"wrong\" password. It is meant to protect you from the <a href=\"https://xkcd.com/538/\" target=\"_blank\" rel=\"noopener noreferrer\">\"wrench attack\"</a>\". It also enables you to create a decoy wallet which has the same mnemonic phrase but uses a different password. If someone forces you to give them access to your wallets, you could provide the decoy password, and keep the real password (with all your funds) a secret.</p>\n<div class=\"alert alert-danger\">\n  Losing this password will result in you losing access to your wallets and funds.\n</div>\n<h3>Mnemonic phrase examples</h3>\n<p>12-word mnemonic phrase:</p>\n<p><code>jealous expect hundred young unlock disagree major siren surge acoustic machine catalog</code></p>\n<p>24-word mnemonic phrase:</p>\n<p><code>deer swift people fluid team beyond east hello peasant purpose apple pony figure puppy spoon window story run strike scout pave address know stadium</code></p>\n<h3>Encrypted mnemonic phrase examples</h3>\n<p>12-word encrypted mnemonic phrase (where <code>cryptocurrency</code> is the password):</p>\n<p><code>jealous expect hundred young unlock disagree major siren surge acoustic machine catalog cryptocurrency</code></p>\n<p>24-word encrypted mnemonic phrase (where <code>encryption</code> is the password):</p>\n<p><code>deer swift people fluid team beyond east hello peasant purpose apple pony figure puppy spoon window story run strike scout pave address know stadium encryption</code></p>\n<h3>Related Reading</h3>\n<ul>\n<li><a href=\"/how-to/accessing-wallet/how-to-access-your-wallet-with-mnemonic-phrase\">How to Access Your Wallet with Mnemonic Phrase</a></li>\n<li><a href=\"/how-to/getting-started/how-to-create-a-wallet\">How to Create a Wallet</a></li>\n<li><a href=\"/how-to/backup-restore/how-to-save-back-up-your-wallet\">How to Properly Save &#x26; Back Up Your Wallet</a></li>\n<li><a href=\"https://en.bitcoin.it/wiki/Mnemonic_phrase\" target=\"_blank\" rel=\"noopener noreferrer\">bitcoin.it wiki article</a></li>\n<li><a href=\"https://doc.satoshilabs.com/trezor-user/advanced_settings.html\" target=\"_blank\" rel=\"noopener noreferrer\">TREZOR's Guide to Passwords</a></li>\n</ul>"}}},"pageContext":{"slug":"general-knowledge/cryptography/how-do-mnemonic-phrases-work","file":"general-knowledge/cryptography/how-do-mnemonic-phrases-work.md"}}