{"data":{"allPage":{"edges":[{"node":{"slug":"developers/add-token-to-default-list","title":"Adding Your Token as a Default Token","excerpt":" If you are experimenting with tokens, you can add a token to your local version of MyCrypto. MyCrypto ships with a default token list that allows our Token Scanner functionality to check balances fo..."}},{"node":{"slug":"developers/adding-a-new-network","title":"Adding a New Network to MyCrypto","excerpt":" Adding support for your Ethereum-like network is easy, assuming it isn't significantly different from the Ethereum network. To make sure your network is well supported, we require the following: Mus..."}},{"node":{"slug":"developers/adding-support-for-web3-wallet","title":"Adding Support for a Web3 Wallet","excerpt":" Identifying Your Provider If you're a web3 wallet developer or user, you'll definitely want to have people see your name and logo when they browse MyCrypto with your browser: It's easy to make that..."}},{"node":{"slug":"developers/contributing-code","title":"How Can I Help Contribute Code?","excerpt":" If you're a developer looking to pitch in, you're more than welcome to help out. Here are some suggestions for diving in: Read the Documentation Make sure you read the entire Readme to understand s..."}},{"node":{"slug":"developers/how-can-i-help-translate","title":"How can I help with translations?","excerpt":" Providing Translations Our team is somewhat multi-lingual, but we rely on the community to help out with languages we don't know. If you're willing to help, we'd really appreciate it. Find your lan..."}},{"node":{"slug":"developers/how-to-submit-pull-request","title":"How to Submit a Pull Request","excerpt":" Navigate to the file you would like to modify. Login or join GitHub. Click the pencil icon in upper right. Make the changes you want to make. At the bottom under \"Commit changes,\" write a short descr..."}},{"node":{"slug":"developers/reporting-a-bug","title":"How To Report A Bug","excerpt":" Reporting a Bug If you've found a bug, or something confusing about MyCrypto, here's what you should do: Search for your issue - If you're experiencing something, the chances are good that someone ..."}},{"node":{"slug":"developers/run-your-own-node-with-mycrypto","title":"Running MyCrypto With Your Own Personal Node","excerpt":" You can use MyCrypto to connect to your own node, which decouples the frontend and features that you love about MyCrypto from our backend infrastructure. This means more nodes send more transactions ..."}},{"node":{"slug":"developers/suggesting-a-feature","title":"How to suggest a feature","excerpt":" If there's a feature that you think would make MyCrypto a better product, we want to know. Here's the best way to tell us: Search for your suggestion - If you've thought of a good new feature,     c..."}},{"node":{"slug":"general-knowledge/about-mycrypto/do-you-have-a-minimum-requirement-to-transfer-out-of-mycrypto","title":"Do you have a minimum requirement to transfer out of MyCrypto?","excerpt":" \"I can't withdraw them from your site because it is less than the minimum required to transfer?\" There actually is no minimum to transfer as we are not an exchange and have no way of blocking your w..."}},{"node":{"slug":"general-knowledge/about-mycrypto/does-mycrypto-support-bitcoin-or-other-coins","title":"Does MyCrypto support Bitcoin or other coins (LTC, STEEM, ZEC)?","excerpt":" MyCrypto supports ETH, ETC, all testnet networks (Ropsten, Kovan, Rinkeby), any other Ethereum-based network (UBQ, EXP, POA etc.) and any Ethereum Standard Tokens - aka \"ERC-20\" tokens. You can use ..."}},{"node":{"slug":"general-knowledge/about-mycrypto/whats-the-difference-between-an-exchange-and-mycrypto","title":"What's the Difference Between an Exchange and MyCrypto?","excerpt":" \"What is the difference between an exchange (e.g. Coinbase, Kraken, Gemini, Poloniex, Bittrex) and MyCrypto?\" Your ETH & tokens are on the blockchain, regardless of what service you use to access th..."}},{"node":{"slug":"general-knowledge/about-mycrypto/how-can-mycrypto-send-offline","title":"How can MyCrypto send offline?","excerpt":" One of the important things that you need to understand is that every address already \"exists\". When you \"create a wallet\" you are not actually doing anything on the blockchain or communicating with ..."}},{"node":{"slug":"general-knowledge/about-mycrypto/official-domain-names-used-by-mycrypto","title":"Official Domain Names Used By MyCrypto","excerpt":" MyCrypto uses several domains to run the service. Each domain serves a specific purpose, such as; running the interface, running the support center, running a public staging area, running RPC nodes. ..."}},{"node":{"slug":"general-knowledge/about-mycrypto/mycryptos-quicktips","title":"MyCrypto's Quick Tips","excerpt":" Hardware wallets ensure your key isn't vulnerable to phishers. Order a TREZOR, Ledger or KeepKey today! The EtherSecurityLookup Chrome Extension warns you if you go to a malicious site: https://chrom..."}},{"node":{"slug":"general-knowledge/cryptography/ethereum-account-generation-and-how-mycrypto-gets-entropy","title":"Ethereum Account Generation & How MyCrypto gets Entropy","excerpt":" This is part of a series where Taylor pull's sweet comments she's made or found over the years in the hopes that they can be useful, searchable, remembered, referenced, and/or aid in the creation of ..."}},{"node":{"slug":"general-knowledge/cryptography/how-do-mnemonic-phrases-work","title":"How do (encrypted) mnemonic phrases work?","excerpt":" A mnemonic phrase or mnemonic seed is a set of typically either 12 or 24 words, which can be used to derive an infinite number of wallets. Often times these phrases are used by cryptocurrency hardwar..."}},{"node":{"slug":"general-knowledge/cryptography/on-components-of-the-ethereum-pre-sale-file-and-encryption","title":"On Components of the Ethereum Pre-Sale File & Encryption","excerpt":" This is part of a series where Taylor pulls sweet comments she has made or found over the years in the hopes that they can be useful, searchable, remembered, referenced, and/or aid in the creation of..."}},{"node":{"slug":"general-knowledge/cryptography/on-keypairs-and-encryption","title":"On Keypairs & Encryption","excerpt":" This is part of a series where Taylor pull's sweet comments she's made in the hopes that they can be useful, searchable, remembered, referenced, and/or aid in the creation of future knowledge base po..."}},{"node":{"slug":"general-knowledge/ens/why-the-ens-bid-process-is-so-complicated","title":"Why the ENS bid process is so complicated","excerpt":" This is part of a series where Taylor pull's sweet comments she's made or found over the years in the hopes that they can be useful, searchable, remembered, referenced, and/or aid in the creation of ..."}},{"node":{"slug":"general-knowledge/ethereum-blockchain/a-glossary-of-common-terms-in-the-ethereum-crypto-space","title":"A glossary of common terms in the Ethereum and crypto space","excerpt":" Words are Hard This is a list of terms you might encounter when using the MyCrypto interface. Asset MyCrypto uses the umbrella term “asset” to refer to any cryptocurrency or token. Cryptocurrency..."}},{"node":{"slug":"general-knowledge/ethereum-blockchain/difference-between-wallet-types","title":"Differences Between Wallet Types (e.g., Private Key vs Keystore)","excerpt":"What are the different types of private key formats that I can use to access my wallet? The ETH is stored on the blockchain. Your private key, Keystore file, or whatever piece of information you have..."}},{"node":{"slug":"general-knowledge/ethereum-blockchain/ethereum-address-has-uppercase-and-lowercase-letters","title":"Ethereum Address Has Uppercase and Lowercase Letters","excerpt":"What does it mean if my address has uppercase and lowercase letters? There are two versions of Ethereum addresses: one that contains uppercase letters and one that does not. 0x7cb57b5a97eabe94205c07..."}},{"node":{"slug":"general-knowledge/ethereum-blockchain/getting-back-to-the-basics-ten-tips-for-newbies","title":"Getting Back to the Basics: 10 Tips for Beginners","excerpt":" Tips Never hand type your address. If you copy and paste your address, do it in incognito mode and still take the time to double-check the address. This attack has not been seen yet, but a lot of Ch..."}},{"node":{"slug":"general-knowledge/ethereum-blockchain/is-the-blockchain-private","title":"Is the Blockchain Private?","excerpt":"“Picture a spreadsheet that is duplicated thousands of times across a network of computers. Then imagine that this network is designed to regularly update this spreadsheet and you have a basic underst..."}},{"node":{"slug":"general-knowledge/ethereum-blockchain/links-you-should-read-next","title":"Links you should read next","excerpt":" The Ethereum Wiki CryptoList: Curated collection of blockchain & cryptocurrency links. EthList: The Crowdsourced Ethereum Reading List https://www.ethadvisor.com/ https://etherenvoy.com/ What is An E..."}},{"node":{"slug":"general-knowledge/ethereum-blockchain/more-help-support-and-communities","title":"More Help, Support and Communities","excerpt":" General Questions and Ethereum Questions:                 /r/ethereum Questions:                 Stack Exchange Getting Started:           Reddit Guide for Noobs:                 /r/ethereumnoobies ..."}},{"node":{"slug":"general-knowledge/ethereum-blockchain/should-i-keep-my-eth-or-tokens-in-single-or-multiple-addresses","title":"Should I keep my ETH and tokens on a single or multiple addresses?","excerpt":" MyCrypto is a front-end interface that enables you to interact directly with the Ethereum blockchain. Any Ethereum address can receive and store Ethereum-based tokens (\"ERC-20\" tokens). MyCrypto en..."}},{"node":{"slug":"general-knowledge/ethereum-blockchain/what-are-internal-transactions","title":"What Are Internal Transactions?","excerpt":" Internal transactions, despite the name (which isn't part of the yellow paper but is a convention people have settled on), are not actual transactions. They are also not included directly in the bloc..."}},{"node":{"slug":"general-knowledge/ethereum-blockchain/what-is-gas","title":"What is gas?","excerpt":" Introduction Ethereum is the network, also known as the blockchain. Ether (ETH) is the fuel for that network. When you send tokens, interact with a contract, send ETH, or do anything else on the blo..."}},{"node":{"slug":"general-knowledge/ethereum-blockchain/what-is-nonce","title":"What is nonce?","excerpt":" In Ethereum, every transaction has a nonce. The nonce is the number of transactions sent from a given address. Each time you send a transaction, the nonce increases by 1. There are rules about what ..."}},{"node":{"slug":"general-knowledge/investing-icos-tokens/best-ways-to-avoid-missing-out-on-that-ico","title":"Best ways to avoid missing out on that ICO","excerpt":" This is part of a series where Taylor pull's sweet comments she's made or found over the years in the hopes that they can be useful, searchable, remembered, referenced, and/or aid in the creation of ..."}},{"node":{"slug":"general-knowledge/investing-icos-tokens/do-i-need-multiple-addresses-for-every-token-sale","title":"Do I need multiple addresses for every token sale?","excerpt":" You do not need multiple wallets for every token sale. You can receive multiple ERC-20 tokens in a single address. If you wish to use multiple address, please note that you will need a small amount o..."}},{"node":{"slug":"general-knowledge/investing-icos-tokens/dunning-krugerrands-fud-list-of-doom-from-early-2016","title":"/u/Dunning_Krugerrands's 'FUD list of doom' from early 2016","excerpt":" This is part of a series where Taylor pulls sweet comments she has made or found over the years in the hopes that they can be useful, searchable, remembered, referenced, and/or aid in creating the fu..."}},{"node":{"slug":"general-knowledge/investing-icos-tokens/getting-through-the-shit-times","title":"Getting through the shit times","excerpt":" Sometimes, crypto really, really, really sucks Believe it or not, most of us have been there. Whether you lose your private key, get phish'd or hacked, make a bad trade, or send to the wrong address..."}},{"node":{"slug":"general-knowledge/investing-icos-tokens/investing-responsibly-by-brian-armstrong-coinbase","title":"Investing Responsibly (by Brian Armstrong / Coinbase)","excerpt":" Please invest responsibly We at Coinbase couldn’t be more excited by the explosion of interest in digital currencies. The last few weeks has seen an unprecedented increase in the price of digital cu..."}},{"node":{"slug":"general-knowledge/investing-icos-tokens/margin-trading-what-to-do-when-you-lose-it-all","title":"Margin Trading: What to do When You Lose it All","excerpt":" This is part of a series where Taylor pulls sweet comments she has made or found over the years in the hopes that they can be useful, searchable, remembered, referenced, and / or aid in the creation ..."}},{"node":{"slug":"general-knowledge/investing-icos-tokens/unsolicited-advice-for-those-holding-token-sales","title":"Unsolicited advice for those holding token sales","excerpt":" This is part of a series where Taylor pulls sweet comments she has made or found over the years in the hopes that they can be useful, searchable, remembered, referenced, and / or aid in the creation ..."}},{"node":{"slug":"general-knowledge/investing-icos-tokens/what-is-an-ico","title":"What is an ICO?","excerpt":" ICO stands for \"Initial Coin Offering,\" and is also known as a “token sale” or \"crowdsale.\" It is an unregulated fundraising method for startups. Startup companies use these funds to further develop ..."}},{"node":{"slug":"general-knowledge/investing-icos-tokens/why-am-i-getting-random-tokens-in-my-wallet","title":"Why am I getting random (airdropped) tokens in my wallet?","excerpt":" Lately, a lot of blockchain projects on Ethereum have been 'airdropping' tokens in the wallets of users. This is done to either spread the distribution of tokens, or to advertise the token to users. ..."}},{"node":{"slug":"how-to/accessing-wallet/how-to-access-your-wallet-with-keystore-file","title":"How to Access Your Wallet with Keystore File","excerpt":" Important Information We do not recommend that you access your wallet via Keystore file. Why? Keystore files are vulnerable for two reasons: Theft    To use a keystore file means you need to uplo..."}},{"node":{"slug":"how-to/accessing-wallet/how-to-access-your-wallet-with-mnemonic-phrase","title":"How to Access Your Wallet with Mnemonic Phrase","excerpt":" Important Information We do not recommend that you access your wallet via mnemonic phrase. Why? Mnemonic phrases are vulnerable for two reasons: Theft    Using a mnemonic phrase requires you to e..."}},{"node":{"slug":"how-to/accessing-wallet/how-to-check-the-balance-of-your-account","title":"How to check the balance of your account","excerpt":" You only need your public wallet address (the one starting with 0x) in order to see your balance. It is not recommended that you access your wallet by entering your private key/Menmonic Phrase/Keysto..."}},{"node":{"slug":"how-to/accessing-wallet/how-to-use-metamask-with-mycrypto","title":"How to use MetaMask with MyCrypto","excerpt":" See Moving from MyCrypto to MetaMask. ..."}},{"node":{"slug":"how-to/accessing-wallet/how-to-use-the-parity-signer-with-mycrypto","title":"How to Use the Parity Signer with MyCrypto","excerpt":" What is the Parity Signer? Parity Signer, available for iOS and Android, is an offline mobile app that securely generates and stores your Ethereum private keys. Most mobile wallets connect to the in..."}},{"node":{"slug":"how-to/accessing-wallet/how-to-use-your-ledger-with-mycrypto","title":"How to use your Ledger hardware wallet with MyCrypto","excerpt":" See Moving from MyCrypto to Ledger. ..."}},{"node":{"slug":"how-to/accessing-wallet/how-to-use-your-trezor-with-mycrypto","title":"How to use your TREZOR hardware wallet with MyCrypto","excerpt":" See Moving from MyCrypto to TREZOR. ..."}},{"node":{"slug":"how-to/backup-restore/how-to-restore-access-to-your-accounts-if-you-lose-or-destroy-your-device-with-google-authenticator-2fa","title":"How to restore access to your accounts if you lose or destroy your device with Google Authenticator (2FA)","excerpt":" This is part of a series where Taylor pulls sweet comments she's made in the hope that they can be useful, searchable, remembered, referenced, and / or aid in the creation of future Knowledge Base po..."}},{"node":{"slug":"how-to/backup-restore/how-to-save-back-up-your-wallet","title":"How to properly save & back up your wallet","excerpt":" Preface The following assumes you are not using a hardware wallet. Due to their ease of use and security, we recommend a hardware wallet for cold storage. To save / backup your Ledger or TREZOR dev..."}},{"node":{"slug":"how-to/backup-restore/trezor-making-a-backup","title":"TREZOR: Making a backup","excerpt":" All you need is the 24 seed words that you wrote down when you first initially setup the TREZOR. You can use the words on MyCrypto to recover your crypto and tokens. If you used any passphrases on t..."}},{"node":{"slug":"how-to/ens/brute-forcing-secret-word-phrases","title":"Brute-Forcing Secret Word Phrases","excerpt":" The following is from /u/eth-o-licious2 on reddit Recently, I was trying to reveal one of my bids and realized that somehow I failed to copy down my three-word secret from MyCrypto, probably because..."}},{"node":{"slug":"how-to/ens/changing-the-ens-owner-or-transferring-an-ens-name","title":"Changing the ENS owner or transferring an ENS Name","excerpt":" Transferring a domain (best practice!) Search for your domain on Etherscan Copy the Label Hash. Go to the Contracts page and select ENS - Eth Registrar (Auction) 0x6090a6e47849629b7245dfa1ca21d94cd1..."}},{"node":{"slug":"how-to/ens/importing-a-bid-created-in-mycrypto-into-ens-and-vice-versa","title":"Importing a bid created in MyCrypto into ENS and vice-versa","excerpt":" The fields of the JSON files created by MyCrypto and ENS (registrar.ens.domains) appear to be different but in fact they have different names and styles for the same thing. Here is a comparison of t..."}},{"node":{"slug":"how-to/ens/manually-revealing-ens-bids-hard","title":"Manually Revealing ENS Bids (Hard)","excerpt":" Use our tool... More easily debug, generate, reveal, and finalize data: https://legacy.mycrypto.com/helpers.html Get the transaction ID of your original bid Under \"input data\" it should look like:..."}},{"node":{"slug":"how-to/ens/manually-revealing-your-ens-bid","title":"Manually revealing your ENS bid","excerpt":" Get your bid transaction hash First, look up your address on Etherscan in order to find the transaction in which you placed your bid. Look for: An outgoing transaction (orange) To ENS-Registrar Wit..."}},{"node":{"slug":"how-to/ens/releasing-ens-names","title":"Releasing ENS names","excerpt":" How to release Your ENS name after a year Navigate to MyCrypto's contracts tab . In the Select Existing Contract dropdown, select the ENS: ETH Registrar (Auction) option. Here is a picture of where ..."}},{"node":{"slug":"how-to/ens/setting-the-resolver-for-an-ens-name","title":"Setting the resolver for an ENS name","excerpt":" Set the resolver for your name Go to the contracts tab. Choose ENS - Registry: 0x314159265dD8dbb310642f98f50C066173C1259b. Click \"Access\". Select setResolver. Find your name on etherscan.io and copy..."}},{"node":{"slug":"how-to/ens/starting-an-auction-without-bidding","title":"Starting an Auction without Bidding","excerpt":" You can open an auction without bidding. It's not the simplest thing in the world, but it's not the worst. It looks harder than it is: Go to https://legacy.mycrypto.com/helpers.html. Find NS Debugg..."}},{"node":{"slug":"how-to/ens/visual-guide-to-buying-vanity-ethereum-addresses-with-ens-and-mycrypto","title":"Visual Guide to Buying Vanity Ethereum Addresses with ENS and MyCrypto","excerpt":" The following was taken from Edward T Giraffe via hackernoon.com. \"Nothing says 'I’m serious about Ethereum' like your name on the blockchain\" Link to Visual Guide to Buying Ethereum Addresses with..."}},{"node":{"slug":"how-to/ens/what-to-do-if-you-forgot-how-much-you-bid","title":"What to do if you forgot how much you bid","excerpt":" First, look up your address on Etherscan in order to find the transaction in which you placed your bid. Look for: An outgoing transaction (orange) To ENS-Registrar With an ETH value > 0.01 ETH (not ..."}},{"node":{"slug":"how-to/ens/what-to-do-if-you-forgot-to-reveal-your-ens-bid","title":"What to do if You Forgot to Reveal Your ENS Bid","excerpt":" If there are other bidders You can get 0.5% back by manually revealing, as written up here. Unfortunately, you must reveal during the reveal period in order to win the name or get the full amount ba..."}},{"node":{"slug":"how-to/getting-started/how-to-buy-ether-with-usd","title":"How to Buy Ether (ETH) with USD","excerpt":" Hello and welcome to Ethereum! Ethereum and digital currencies are pretty new and in this new world, things can be a little bit different. First, you are responsible for your stuff: your investments..."}},{"node":{"slug":"how-to/getting-started/how-to-create-a-wallet","title":"How to create a wallet","excerpt":" Preface We highly recommend getting a hardware wallet or using MetaMask as a method to access your wallet and store your funds. The following assumes you are not using a hardware wallet or MetaMask..."}},{"node":{"slug":"how-to/getting-started/how-to-get-started-on-mycrypto","title":"How to get started on MyCrypto","excerpt":" Please take some time to understand this for your own safety. Your funds will be stolen if you do not heed these warnings. What is MyCrypto? MyCrypto is a free, open-source, client-side interface. ..."}},{"node":{"slug":"how-to/getting-started/how-to-sign-and-verify-messages-on-ethereum","title":"How to sign & verify messages on Ethereum","excerpt":" Why? With Ethereum, signatures are a way of providing evidence that a specific user has access to a specific address. For example, if user A wants to provide evidence to user B that user A has acce..."}},{"node":{"slug":"how-to/getting-started/where-can-i-buy-sell-trade-or-exchange-my-eth-or-tokens","title":"Where Can I Buy / Sell / Trade / Exchange my ETH or Tokens?","excerpt":" Here is a list of reputable services you can use to buy and sell ETH / Tokens / fiat (USD, EUR, etc.). There are many, many more out there but these are the ones we are familar with. Pro Tip: Always..."}},{"node":{"slug":"how-to/getting-started/where-to-get-testnet-ether","title":"Where to Get Testnet Ether?","excerpt":" Where to get testnet Ether? There are currently 3 different testnets for the Ethereum public chain: Rinkeby Ropsten Kovan Rinkeby Rinkeby is a public testnet for Ethereum that uses PoA (Proof of ..."}},{"node":{"slug":"how-to/hardware-wallets/multiple-addresses-showing-on-hardware-wallet","title":"Multiple Addresses Showing on Hardware Wallet","excerpt":"Multiple addresses show up when I access my hardware wallet ... which one should I use? The style of keys that Ledger, TREZOR, Jaxx, and MetaMask use are known as HD (\"Hierarchical Deterministic\") ke..."}},{"node":{"slug":"how-to/hardware-wallets/ledger/how-to-use-a-ledger-wallet-with-android","title":"Using a Ledger with an Android device","excerpt":" Requirements In order to use a Ledger Wallet with your Android phone, you need to have a modern phone or tablet that supports USB-OTG (USB On-The-Go) as well as a USB-OTG adapter to go with it. If y..."}},{"node":{"slug":"how-to/migrating/access-your-jaxx-account-on-mycrypto","title":"[Jaxx ➡ MyCrypto] Access your Jaxx account on MyCrypto","excerpt":" You can use both MyCrypto and Jaxx at the same time; both are client side wallets that simply allow you to access your ETH on the blockchain. There is no need to \"import\" or \"sweep\" your ETH from you..."}},{"node":{"slug":"how-to/migrating/access-your-mycrypto-account-in-geth-or-mist","title":"[MyCrypto ➡ Mist] Access Your MyCrypto Account in Geth / Mist","excerpt":" Mist & Geth Mist files are typically found in the file locations below but it's much easier to open Mist, select \"Accounts\" in the top bar, select \"Backup,\" and select \"Accounts.\" This will open the..."}},{"node":{"slug":"how-to/migrating/access-your-mycrypto-account-in-parity","title":"[MyCrypto ➡ Parity] Access Your MyCrypto Account in Parity","excerpt":" Starting from Parity v1.10, the Parity Ethereum client (the node) has been separated from the Parity User Interface (UI). The user interface, accessible from the browser in previous versions up to an..."}},{"node":{"slug":"how-to/migrating/how-to-change-your-wallet-password-unencrypted-to-encrypted","title":"Change your wallet password (Unencrypted -> Encrypted)","excerpt":"Can I turn my unencrypted private key into an encrypted private key? Yes, you can encrypt your private key using MyCrypto by accessing your address on https://mycrypto.com/account/info and then click..."}},{"node":{"slug":"how-to/migrating/moving-from-coinbase-to-mycrypto","title":"[Coinbase ➡ MyCrypto] Moving from Coinbase to MyCrypto","excerpt":"How do I move from Coinbase to MyCrypto? [Exchange/Hosted Wallet -> MyCrypto] So you want to hold your own funds? Are you sure? Please understand the difference between an exchange and MyCrypto. My..."}},{"node":{"slug":"how-to/migrating/moving-from-mycrypto-to-ledger","title":"[MyCrypto ➡ Ledger] Moving from MyCrypto to Ledger","excerpt":" The Ledger Nano S is one of the best and easiest-to-use cryptocurrency hardware wallets out there, and is available for purchase here. While the Ledger Nano S supports a wide range of cryptocurrencie..."}},{"node":{"slug":"how-to/migrating/moving-from-mycrypto-to-metamask","title":"[MyCrypto ➡ MetaMask] Moving from MyCrypto to MetaMask","excerpt":" Using MetaMask + MyCrypto has 3 key benefits: If you use MetaMask, it is far less likely you will be phished or affected by a phishing site, as your key remains in MetaMask and the scam website will..."}},{"node":{"slug":"how-to/migrating/moving-from-mycrypto-to-trezor","title":"[MyCrypto ➡ TREZOR] Moving from MyCrypto to TREZOR","excerpt":" The TREZOR is one of the best and easiest-to-use cryptocurrency hardware wallets out there, and is available for purchase here. While the TREZOR supports a wide range of cryptocurrencies, this guide ..."}},{"node":{"slug":"how-to/nodes-networks/access-eth-sent-to-etc-address-or-etc-sent-to-eth-address","title":"Access ETH sent to ETC address or ETC sent to ETH address","excerpt":"\"I sent ETC to my ETH wallet by mistake\". How to In order to see your ETC and interact with the ETC chain, you must first be on an ETC node. Select \"ETC (AUTO)\" in the network-switcher in the top-r..."}},{"node":{"slug":"how-to/offline/how-to-run-mycrypto-offline-and-locally","title":"How To Run MyCrypto Offline and Locally","excerpt":" For increased security, you can run MyCrypto locally on your computer with our desktop application. The computer should have no internet connection. You can generate a wallet completely offline and s..."}},{"node":{"slug":"how-to/offline/is-the-view-and-send-page-offline","title":"Is the 'View & Send' Page Offline?","excerpt":" No, it needs the internet in order to get the current gas price, nonce of your account, and broadcast the transaction (aka \"send\"). However, it only sends the signed transaction. Your private key sta..."}},{"node":{"slug":"how-to/offline/using-a-ledger-wallet-offline","title":"Using a Ledger Wallet Offline","excerpt":" Storing your ETH, tokens, ETC, BTC and many other cryptocurrencies on a hardware wallet like the Ledger wallet is one of the safest and easiest ways to store your coins. Though the keys are stored on..."}},{"node":{"slug":"how-to/offline/using-mycrypto-for-cold-storage","title":"Using MyCrypto For Cold Storage","excerpt":" Preface The following assumes you are not using a Ledger or TREZOR hardware wallet. Due to their ease of use and security, we recommend a hardware wallet for cold storage. To save / backup your Led..."}},{"node":{"slug":"how-to/sending/checking-or-replacing-a-transaction-after-it-has-been-sent","title":"Checking or replacing a transaction after it's been sent","excerpt":" How can I check on the status of my transaction? Etherscan's Pending Transactions Our Check Transaction Status Tab Canceling or replacing a transaction Can I cancel, override, overwrite, replace, ..."}},{"node":{"slug":"how-to/sending/creating-prefilled-transaction","title":"Creating a Pre-Filled Transaction Link","excerpt":" How can I create a pre-filled transaction link? Pre-Filled Transactions can be created by appending certain parameters into the query section of a url. Each individual parameter must include a & at ..."}},{"node":{"slug":"how-to/sending/how-to-interact-with-a-multisig-contract","title":"How to interact with a Multisig Contract","excerpt":" Getting Started Go to the Contract tab on MyCrypto.com. There should be a Mist Multisig Contract ABI in the dropdown. If not, you can manually use the ABI at the bottom of this page. Do the stuff ..."}},{"node":{"slug":"how-to/sending/how-to-know-what-gas-price-or-gas-limit-to-use","title":"How to know what gas price and gas limit to use","excerpt":" If you encounter the following error \"Warning! Error encountered during contract execution [Out of Gas], you can use the following steps below to determine the gas limit needed for your transaction. ..."}},{"node":{"slug":"how-to/sending/how-to-make-an-offline-transaction","title":"How to make an offline transaction","excerpt":" If you are using MyCrypto offline and locally, it is not possible to send transactions from the offline computer. An internet connection is required to send or broadcast a transaction. To do this, yo..."}},{"node":{"slug":"how-to/sending/how-to-schedule-a-transaction","title":"How to Schedule a Transaction","excerpt":" It is now possible to schedule transactions to be sent later, powered by the Ethereum Alarm Clock project. Simply put, it works by sending your transaction to a \"time node\" which will broadcast the t..."}},{"node":{"slug":"how-to/sending/how-to-send-a-transaction","title":"How To Send A Transaction","excerpt":" If you plan to move a large amount of Ether or tokens, you should first send a test transaction of a small amount to the destination wallet to ensure everything goes as planned. Optional, but highly ..."}},{"node":{"slug":"how-to/sending/how-to-send-ethereum-classic-via-mycrypto","title":"How to send Ethereum Classic (ETC) via MyCrypto","excerpt":" In order to see your ETC and interact with the ETC chain, you must first connect to an ETC node. Select \"ETC (AUTO)\" in the node-switcher in the top-right corner of MyCrypto, or in the bottom-left c..."}},{"node":{"slug":"how-to/sending/sending-and-adding-tokens","title":"Sending & Adding Tokens","excerpt":" Navigate to the View & Send page. Unlock your wallet. Enter the address you would like to send to in the \"To Address:\" field. Enter the amount you would like to send. Select which token you would lik..."}},{"node":{"slug":"how-to/sending/trezor-sending-from","title":"TREZOR: Sending From","excerpt":" Here is how you can unlock your wallet, access your ETH and tokens, and send from your TREZOR hardware wallet: Go to https://mycrypto.com/account. To send ETH, check to make sure you are using an E..."}},{"node":{"slug":"how-to/sending/trezor-sending-to","title":"TREZOR: Sending to","excerpt":" Here is how you can get your address to send to your TREZOR: Go to https://mycrypto.com/account. To send ETH, check to make sure you are using an Ethereum node by looking at the Network Switcher in ..."}},{"node":{"slug":"how-to/tokens/how-to-receive-tokens","title":"How to receive tokens","excerpt":" How to receive ERC-20 tokens You can receive any ERC20 token by simply sending it to your Ethereum address (that´s the one starting with \"0x....\"). If the token is not in our default token list, yo..."}},{"node":{"slug":"how-to/tokens/showing-and-loading-tokens","title":"Showing and Loading Tokens","excerpt":" How to load token balances Click the \"Scan for Tokens\" Button. It will scan for all tokens in your account. Your tokens should appear if the token is on our token list. If you would like to load t..."}},{"node":{"slug":"staying-safe/advanced-secure-wallets-by-tomshwom","title":"Advanced: Creating a Secure Wallet by Tomshwom","excerpt":" Preface This is the updated version of the original post on Steemit here. By /u/AtLeastSignificant. Purpose In this guide, we are going to create a customizable wallet solution that is cheap, sec..."}},{"node":{"slug":"staying-safe/call-to-action-help-us-with-phishers-please","title":"How to Help Defeat the Phishers","excerpt":" These phishers will not stop until they stop getting money or get caught. We don't have the time or manpower to do it all. There are so many things to do and watch and document. We thank you for your..."}},{"node":{"slug":"staying-safe/couldnt-everybody-put-in-a-random-key-and-send-to-own-address","title":"Couldn't Everybody Type in Random Private Keys and Steal Funds?","excerpt":" Short Version Yes, but finding an account with a balance would take eons ... so ... no. Long Version Ethereum is based on Public Key Cryptography, specifically Elliptic Curve Cryptography, which i..."}},{"node":{"slug":"staying-safe/ethereum-two-people-same-private-key","title":"Ensuring MyCrypto Doesn't Give Different People the Same Private Key","excerpt":" \"How does Ethereum ensure that two people aren't given the same key?\" First of all, a wallet's private key is not given, it is randomly generated. Then the public key is derived from it and, finally..."}},{"node":{"slug":"staying-safe/hardware-wallet-recommendations","title":"Hardware Wallet Recommendations","excerpt":" One of the safest and easiest ways to store your ETH, tokens, ETC, BTC, and many other coins is via a Ledger Nano S or TREZOR. Both are hardware wallets. Both work with MyCrypto.com and the MyCrypto ..."}},{"node":{"slug":"staying-safe/how-can-we-trust-mycrypto","title":"How Can We Trust MyCrypto?","excerpt":" The quickest answer is: Luckily, you don't have to trust us! You can run us offline. You can use a hardware wallet. These both ensure that your keys never touch an internet-connected device, which ..."}},{"node":{"slug":"staying-safe/how-to-securely-store-and-guard-your-private-key","title":"Securely store & guard your private key by drewshaver","excerpt":" Source: /u/drewshaver Preface This guide assumes that you just received a Trezor and Cryptosteel in the mail. Which hardware wallet you chose is not integral to the guide -- any hardware wallet wil..."}},{"node":{"slug":"staying-safe/how-to-stay-safe","title":"How to stay safe during ICOs and other periods","excerpt":" Domain verification The problem There are many website clones of ICOs with fake contribution addresses. Sometimes they use character substitutions in the domain (e.g., an \"i\" becomes an \"l\" in the ..."}},{"node":{"slug":"staying-safe/mycrypto-protips-how-not-to-get-scammed-during-ico","title":"How to avoid getting scammed and phished","excerpt":" Below are some tips to reduce the risk of losing your hard-earned coins Install EtherSecurityLookup if you use Twitter, and either EtherAddressLookup or MetaMask if you use MyCrypto or other crypto-..."}},{"node":{"slug":"staying-safe/phish-hacks-thefts-and-stolen-funds-due-to-phishing","title":"What to Do If Your Funds Are Stolen","excerpt":" Victim of a phishing attack? We are sorry this happened Unfortunately, we encounter these phishing scams / attacks on a daily basis. The most common cause for these incidents is entering your privat..."}},{"node":{"slug":"staying-safe/protecting-yourself-and-your-funds","title":"Protecting Yourself and Your Funds","excerpt":" 1. Get yourself a hardware wallet. One of the safest and easiest ways to store your ETH, Tokens, ETC, BTC, and many other coins is via a Ledger Nano S or TREZOR. Both are hardware wallets. Both work..."}},{"node":{"slug":"staying-safe/turning-on-2fa-on-mycrypto","title":"Can I turn on 2FA for MyCrypto?","excerpt":" No. And if you landed on a site telling you that you could, they are lying to you and trying to steal your private keys. 2FA / MFA is something that works for server-side applications in order to ad..."}},{"node":{"slug":"staying-safe/verifying-authenticity-of-desktop-app","title":"Verifying the authenticity of the desktop application","excerpt":" After downloading the desktop application, it's highly recommended to verify the checksum of the application. This ensures that you are using the real MyCrypto desktop application and not one that ha..."}},{"node":{"slug":"staying-safe/why-you-should-backup-your-hardware-wallet","title":"Why you should backup your hardware wallet","excerpt":" Preface The following assumes you are using a Ledger Nano S or TREZOR hardware wallet. Due to their ease of use and security, we recommend a hardware wallet for cold storage. To save / backup your ..."}},{"node":{"slug":"staying-safe/common-scams/common-scams-overview","title":"Overview of Common Scams","excerpt":" Introduction This document set is intended to be a compendium of types of scams that can be found in Ethereum and in the wider cryptocurrency ecosystem. Why is This Important? Security is probably..."}},{"node":{"slug":"staying-safe/common-scams/hardware-wallet-scams-overview","title":"Hardware Wallet Scams and Hacks","excerpt":" General Tips for Securing Hardware Wallets Update the firmware of your device. Don't leave your device plugged in. Make sure your device is physically secure. Don't purchase pre-owned devices. Pre-..."}},{"node":{"slug":"staying-safe/common-scams/malicious-software-overview","title":"Malicious Software","excerpt":" Malicious Software-Based Attacks Malicious software is anything that changes the functionality of your computer for the purpose of making someone else profit in some way. Malicious software can come..."}},{"node":{"slug":"staying-safe/common-scams/phishing-overview","title":"Phishing Scams and Hacks","excerpt":" Phishing Phishing is scamming via impersonating individuals, organizations, operations, websites, etc. Phishing is also the most common type of scam / attack on your funds in any cryptocurrency eco..."}},{"node":{"slug":"staying-safe/common-scams/privacy-concerns-overview","title":"Privacy Concerns","excerpt":" Privacy Concerns Posting Your Public Keys on Social Media Why is this a problem? You should never do this, especially if you have a large amount of crypto-wealth, because it paints a target on you..."}},{"node":{"slug":"troubleshooting/cannot-see-the-extended-validation-certificate","title":"Cannot See the Extended Validation ('MyCrypto, Inc.') Certificate","excerpt":" On MyCrypto.com you should be able to see the Extended Validation Certificate (EV SSL) in your  URL bar. However, some anti-virus applications like BitDefender prevent you from seeing the EV SSL. The..."}},{"node":{"slug":"troubleshooting/unable-to-connect-to-custom-node","title":"Unable to Connect to Custom Node","excerpt":" Verify the URL you entered is correct. Verify the port you entered is correct. Verify that if you are connecting to an http:// node, you are running MyCrypto locally (NOT over https://). Verify yo..."}},{"node":{"slug":"troubleshooting/accessing-wallet/accessing-different-address-same-private-key-ether","title":"Private Key Opens a Different Account / Two Addresses","excerpt":" Mismatched Private Key / Address Please be sure that you are carefully and accurately typing in your private key. A single wrong character will open a different wallet than \"yours.\" For reference, ..."}},{"node":{"slug":"troubleshooting/accessing-wallet/ledger-hardware-wallet-unable-to-connect-on-mycrypto","title":"Unable to Connect Ledger Hardware Wallet on MyCrypto","excerpt":" Sample error message: \"Your Ledger is currently in use with another application. Please wait, or close other wallet applications before trying again.\" Please try the following. This solves 99% of pr..."}},{"node":{"slug":"troubleshooting/accessing-wallet/lost-eth-private-key","title":"Lost Private Key","excerpt":" MyCrypto is not a \"web wallet.\" You do not create an account or give us your crypto or tokens to hold on to. We are simply an interface that allows you to easily interact with cryptocurrencies. In o..."}},{"node":{"slug":"troubleshooting/accessing-wallet/lost-ethereum-wallet-password","title":"Lost Password","excerpt":" MyCrypto is not a \"web wallet.\" You do not create an account or give us your crypto or tokens to hold on to. MyCrypto is simply an interface that allows you to easily interact with cryptocurrency. I..."}},{"node":{"slug":"troubleshooting/accessing-wallet/lost-password-ethereum-presale-wallet-file","title":"Lost Password - Ethereum Presale Wallet File","excerpt":" Important note: This article is talking about presale wallets, for regular wallets take a look at the Lost Password article. I forgot the password to my presale wallet file While there is no way to..."}},{"node":{"slug":"troubleshooting/accessing-wallet/missing-characters-of-private-key","title":"Missing Characters from Private Key","excerpt":" Credit goes to Bahk () for making the best helper tools ever! How to use (for beginners) Click \"Raw\" on https://gist.github.com/tayvano/7755e3e8d8b64581d5ff2865087b93f8 Right click, select \"Save As..."}},{"node":{"slug":"troubleshooting/accessing-wallet/private-key-not-working","title":"Private Key Not Working","excerpt":" Be sure there is no space at the beginning or end of your private key. We validate based on the number of characters. If you saved another version (for example, the UTC / Keystore file) it may also b..."}},{"node":{"slug":"troubleshooting/accessing-wallet/unlocking-keystore-file-freezes-browser","title":"When I unlock via keystore file, it freezes my browser","excerpt":"Decrypting the keystore files is an intensive process and doesn't enjoy being done in Javascript. We recommend... Using Google Chrome Clicking \"continue\" when you see the unresponsive error alert pop..."}},{"node":{"slug":"troubleshooting/ens/ens-debugging-a-bad-instruction-reveal","title":"Debugging a [BAD INSTRUCTION] Reveal","excerpt":" 1. Make sure you actually placed a bid Look up your address on Etherscan in order to find the transaction in which you placed your bid. It will be an outgoing transaction (orange) To ENS-Registrar W..."}},{"node":{"slug":"troubleshooting/hardware-wallets/archos/archos-safet-mini","title":"Archos Safe-T Mini User Guide ","excerpt":" Below is a guide on how to use the Archos Safe-T Mini Hardware Wallet with MyCrypto. We strongly recommend getting a hardware wallet to store your Ether and / or ERC-20 tokens. Please note that this ..."}},{"node":{"slug":"troubleshooting/hardware-wallets/ledger/error-code-5","title":"Error Code 5","excerpt":" The most common fix: close other Ledger applications. Close all other Ethereum applications, Ledger applications, and MyCrypto tabs. Error code 5 means that another application is already connected ..."}},{"node":{"slug":"troubleshooting/hardware-wallets/ledger/ledger-hardware-wallet-error-invalid-status-6a80","title":"Invalid status 6a80","excerpt":" In order to send data (e.g., when sending tokens) with your transaction via your Ledger Nano S or Ledger Blue, you need to enable \"contract data\" on your Ledger device. If you do not, you will receiv..."}},{"node":{"slug":"troubleshooting/hardware-wallets/ledger/ledger-hardware-wallet-missing-characters-from-address","title":"Not all characters of address are showing when I click 'Display Address'","excerpt":" This is fixed when updating the ETH application from Ledger Manager. You can learn how to do this by following  this guide. If that doesn't fix the issue, you may need to delete the application and ..."}},{"node":{"slug":"troubleshooting/hardware-wallets/ledger/u2f-not-supported-error","title":"U2F Not Supported Error","excerpt":" If you see the \"U2F not supported\" error, this means that your browser does not (properly) support the U2F protocol. This protocol is used by MyCrypto to connect with your hardware wallet. To solve ..."}},{"node":{"slug":"troubleshooting/hardware-wallets/trezor/trezor-error-window-blocked","title":"TREZOR: Window Blocked Before Confirming Transaction","excerpt":"I keep getting a message saying \"Window Blocked\" before confirming my transaction. When connecting to your TREZOR device, you need to ALLOW POP-UPS on MyCrypto.com. This allows information to safely..."}},{"node":{"slug":"troubleshooting/sending/errcode-unable-to-locate-corresponding-transfer-event-log","title":"Error: Unable to Locate Corresponding Transfer Event Log","excerpt":" Why does this keep happening?! This error appears on Etherscan when a sender tries to transfer out more tokens than they have. Generally, this can happen due to a few possible events: When adding ..."}},{"node":{"slug":"troubleshooting/sending/error-bad-jump-destination-or-out-of-gas-error","title":"Transaction has a 'Bad Jump Destination' or 'Out of Gas' Error","excerpt":"My transaction has a Bad jump destination or Out of Gas error. When do I get my ETH back? When a transaction fails due to a Bad jump destination or Out of Gas error, the ETH never actually leaves you..."}},{"node":{"slug":"troubleshooting/sending/error-insufficient-funds-message","title":"Error: Cannot send due to insufficient funds","excerpt":" If you are getting the error, \"WARNING: Your ether or token balance isn't high enough to complete this transaction. Please send more funds or switch to a different wallet.\", it means you do not have ..."}},{"node":{"slug":"troubleshooting/sending/eth-or-tokens-not-showing-on-exchange","title":"ETH or Tokens sent to or from exchange haven't shown up","excerpt":" First, check the transaction on Etherscan or Etherchain, and ensure that there is no red ( ! ) symbol by the transaction. Successful transactions Example from Etherscan Example from Etherchain Uns..."}},{"node":{"slug":"troubleshooting/sending/ethereum-balance-not-loading-or-showing","title":"Balances Not Loading or Showing on MyCrypto","excerpt":" This is most likely due to the fact that either you are behind a firewall, you have refreshed the page a bunch of times and hit your hourly API limit, or our nodes are under extreme strain and are re..."}},{"node":{"slug":"troubleshooting/sending/not-checksummed-shows-when-i-enter-an-address","title":"Error: 'Not Checksummed' When Entering Address","excerpt":" What is a checksummed address? A checksummed address is an address that contains uppercase letters, as specified in EIP-55. Checksummed addresses are meant to help prevent users from sending transac..."}},{"node":{"slug":"troubleshooting/sending/transaction-failed-out-of-gas","title":"Transaction Failed: Out of Gas","excerpt":" Each transaction (TX) on the Ethereum blockchain (including token and contract transactions) requires gas, which is paid in Ether. You can think of this as a transaction fee. The more computational e..."}},{"node":{"slug":"troubleshooting/sending/transaction-fee-not-refunded","title":"Transaction Failed: TX Fee not Refunded","excerpt":"\"Why didn't I get my transaction fee (TX Fee) back, even though my transaction failed?\"* Ethereum is the network—the blockchain. Ether (ETH) is the fuel for that network. When you send tokens, intera..."}},{"node":{"slug":"troubleshooting/sending/transactions-not-showing-or-pending","title":"Transactions Not Showing Up or Pending Forever","excerpt":" At times, combinations of new users, increased interest, popular apps like CryptoKitties, and misc. ICOs can create quite a mess of the transaction (TX) pool. This sometimes results in an accumulatio..."}},{"node":{"slug":"troubleshooting/sending/what-to-do-if-you-sent-to-wrong-address","title":"What to do if you sent to the wrong address","excerpt":" MyCrypto is not a \"web wallet.\" You do not create an account or give us your ETH or tokens to hold onto. We are simply an interface that allows you to easily interact with cryptocurrency. In order t..."}},{"node":{"slug":"troubleshooting/tokens/adding-custom-token-errors-fix","title":"How to fix accidentally inputting incorrect custom token details","excerpt":" Not a valid ERC-20 token error A Not a valid ERC-20 token error can occur when an incorrect contract address was added as a custom token. Token has 0 balance Be sure to use the correct contract ad..."}},{"node":{"slug":"troubleshooting/tokens/adding-new-token-and-sending-custom-tokens","title":"Unable to See Tokens (How to add a custom token)","excerpt":" How to add a new ERC-20 token If you can't see a token when you access your wallet on MyCrypto, you simply just need to add it to your interface in order to see it and then send it in a transaction...."}}]}}}