{"data":{"site":{"siteMetadata":{"title":"MyCrypto Knowledge Base"}},"category":{"title":"About MyCrypto","slug":"general-knowledge/about-mycrypto","description":"TODO","childrenCategory":[],"breadcrumbs":[{"title":"General Knowledge","slug":"general-knowledge"},{"title":"About MyCrypto","slug":"general-knowledge/about-mycrypto"}]},"allCategory":null,"allPage":{"edges":[{"node":{"title":"Official Domain Names Used By MyCrypto","slug":"general-knowledge/about-mycrypto/official-domain-names-used-by-mycrypto","excerpt":" MyCrypto uses several domains to run the service. Each domain serves a specific purpose, such as; running the interface, running the support center, running a public staging area, running RPC nodes. ..."}},{"node":{"title":"MyCrypto's Quick Tips","slug":"general-knowledge/about-mycrypto/mycryptos-quicktips","excerpt":" Hardware wallets ensure your key isn't vulnerable to phishers. Order a TREZOR, Ledger or KeepKey today! The EtherSecurityLookup Chrome Extension warns you if you go to a malicious site: https://chrom..."}},{"node":{"title":"What's the Difference Between an Exchange and MyCrypto?","slug":"general-knowledge/about-mycrypto/whats-the-difference-between-an-exchange-and-mycrypto","excerpt":" \"What is the difference between an exchange (e.g. Coinbase, Kraken, Gemini, Poloniex, Bittrex) and MyCrypto?\" Your ETH & tokens are on the blockchain, regardless of what service you use to access th..."}},{"node":{"title":"Do you have a minimum requirement to transfer out of MyCrypto?","slug":"general-knowledge/about-mycrypto/do-you-have-a-minimum-requirement-to-transfer-out-of-mycrypto","excerpt":" \"I can't withdraw them from your site because it is less than the minimum required to transfer?\" There actually is no minimum to transfer as we are not an exchange and have no way of blocking your w..."}},{"node":{"title":"How can MyCrypto send offline?","slug":"general-knowledge/about-mycrypto/how-can-mycrypto-send-offline","excerpt":" One of the important things that you need to understand is that every address already \"exists\". When you \"create a wallet\" you are not actually doing anything on the blockchain or communicating with ..."}},{"node":{"title":"Does MyCrypto support Bitcoin or other coins (LTC, STEEM, ZEC)?","slug":"general-knowledge/about-mycrypto/does-mycrypto-support-bitcoin-or-other-coins","excerpt":" MyCrypto supports ETH, ETC, all testnet networks (Ropsten, Kovan, Rinkeby), any other Ethereum-based network (UBQ, EXP, POA etc.) and any Ethereum Standard Tokens - aka \"ERC-20\" tokens. You can use ..."}}]}},"pageContext":{"slug":"general-knowledge/about-mycrypto"}}