{"data":{"page":{"title":"On Keypairs & Encryption","slug":"general-knowledge/cryptography/on-keypairs-and-encryption","originalSlug":"general-knowledge/cryptography/on-keypairs-and-encryption","description":"Best Of","datePublished":"2017-07-05","dateModified":"2018-12-19","parent":{"__typename":"Category","title":"Cryptography & Encryption"},"breadcrumbs":[{"title":"General Knowledge","slug":"general-knowledge"},{"title":"Cryptography & Encryption","slug":"general-knowledge/cryptography"},{"title":"On Keypairs & Encryption","slug":"general-knowledge/cryptography/on-keypairs-and-encryption"}]},"file":{"childMarkdownRemark":{"html":"<p>This is part of a series where Taylor pull's sweet comments she's made in the hopes that they can be useful, searchable, remembered, referenced, and/or aid in the creation of future knowledge base posts. These are works in progress. Please excuse the typos, unclear statements, specific references to previous discussions or the user, and gratuitous cursing.</p>\n<hr>\n<p>The Ledger (and other hardware wallets) are essentially USB sticks but with really really really really really really hardcore software / firmware / hardware that makes it so your key cannot be accessed or moved, even if your computer is compromised. With a regular USB drive, 1337 h4x0r can do crazy shit to get the info from it via hardware alone, watching the read/writes, or simply searching for your private key, mnemonic, or keystore file on the USB drive. Ledger / TREZOR are dedicated devices built to prevent all these types of attacks.</p>\n<h2>Keypairs &#x26; cryptography</h2>\n<p>The private key (or keystore file or mnemonic or hardware wallet) is basic cryptography in the end; the same cryptography that is used in all sorts of systems that have been around far longer than cryptocurrencies.</p>\n<p>At it's most basic, a <code>private key</code> can turn into a <code>public key</code> but a <code>public key</code> cannot turn into a <code>private key</code>. However, this public key (via fancy math and really really intense stuff) can <em>verify that a specific private key was used to sign the transaction</em>.</p>\n<p>Imagine this: You have a buddy in the other room who says a word. The word either has 1 syllable, 5 syllables, or 20 syllables. You cannot hear <em>what</em> he says, but you can easily verify that the word he said was short, medium, or ultra-long. So you <em>know</em> what word he said (given there were only 3 choices) even though you don't <em>know the actual word</em>. Cryptography is a bit like that, except it involves fancy graphs, extreme math, and an almost infinite number of private keys (aka \"the word your buddy said\").</p>\n<h3>Verifying the private key corresponds to public key</h3>\n<p>So back to your question-ish: <em>If it's the private key is unlocking the wallet from elsewhere...</em></p>\n<p>It's not actually unlocking from elsewhere. There is no server; the blockchain does not know about your private key or password or address (public key) even. It's not the same as what you are used to with email and facebook and all the new-fangled jazz.</p>\n<p>The blockchain simply checks if the transaction you want to send (e.g. <code>1 ETH</code> to <code>0x2a9F48....</code> from <code>0x92fbC3.....</code>) is valid:</p>\n<ul>\n<li>Does the <code>from address</code> have 1 ETH to send?</li>\n<li>Did the private key pair of that address (the public key) sign the transaction?</li>\n</ul>\n<p>I could sign a transaction saying <code>0x92fbC3.....</code> wants to send <code>1 ETH</code> to <code>0x2a9F48....</code> with any key I wanted to. I could just make it up off the top of my head. But it would fail check #2, and therefore never be accepted into the blockchain, and therefore the funds (which are your funds) would never move.</p>\n<p>The only way to move funds is to send those funds with a transaction signed by the private key that corresponds to the address you are sending from. And the amount of private keys available is so insanely large that it would take a fuckload of years to ever be able to guess someone else's private key. It's quite simple. (<a href=\"/staying-safe/couldnt-everybody-put-in-a-random-key-and-send-to-own-address\">More on that here if you are interested</a>)</p>\n<h3>Fancy keys, passwords &#x26; encryption</h3>\n<p>Okay bear with me one more thing.</p>\n<p>Private keys can be fancy: they can be keystore files (which are encrypted with a password) or mnemonic phrases (which can be encrypted with a password, are easier to read, and give you access to multiple addresses / accounts / keypairs)</p>\n<p>When we say encrypted we mean that you must do something first, before you can use the private key to sign the transaction. Encryption works like this:</p>\n<ul>\n<li>You take <code>7</code> (your private key) and you multiply it by <code>10</code> (your password) which outputs <code>70</code>.</li>\n<li>The <code>70</code> is now your encrypted key</li>\n<li>You can't use <code>70</code> to sign a transaction because it's gibberish</li>\n<li>You can take <code>70</code> and divide it by <code>10</code> in order to get <code>7</code>. But you can't figure out what <code>7</code> is unless you have that secondary piece of information (your password / <code>10</code>). <code>7 x 10 = 70</code> and <code>70 / 10 = 7</code> but if you only have 70 you have an infinite number of possibilities for the private key and password: it could be <code>14 x 5</code> or <code>9 x 7.777777778</code> and on and on.</li>\n</ul>\n<p>Again, there is no server verifying your password or private key. It's all done by your computer and all it knows is that it's either correct or incorrect by trying it:</p>\n<ul>\n<li>if you take <code>70</code> and divide it by <code>8</code>, you get <code>8.75</code> which is not the private key for the public key you want to send from.</li>\n<li>if you take <code>70</code> and divide it by <code>0</code>, the world ends bc you can't divide by 0, silly.</li>\n<li>if you take <code>70</code> and divide it by <code>80000</code>, you get <code>0.000875</code> which is way too small to be a private key.</li>\n</ul>\n<p>...and so forth and so forth. When you give it the correct password, it gets a valid private key, and then it can sign the transaction, which can then be put on the blockchain, and you successfully sent your ETH.</p>\n<p>I hope this helps somewhat. I know it's long, typo-filled, and probably confusing but come back and re-read it in a week or month and see how much more you grok. ?</p>\n<h2>Source</h2>\n<ul>\n<li><a href=\"https://www.reddit.com/r/MyCrypto/comments/6vm6xa/moron_question_why_the_wallet/dm3ntq9/\" target=\"_blank\" rel=\"noopener noreferrer\">https://www.reddit.com/r/MyCrypto/comments/6vm6xa/moron<em>question</em>why<em>the</em>wallet/dm3ntq9/</a></li>\n</ul>"}}},"pageContext":{"slug":"general-knowledge/cryptography/on-keypairs-and-encryption","file":"general-knowledge/cryptography/on-keypairs-and-encryption.md"}}