{"data":{"page":{"title":"Using MyCrypto For Cold Storage","slug":"how-to/offline/using-mycrypto-for-cold-storage","originalSlug":"how-to/offline/using-mycrypto-for-cold-storage","description":"Offline","datePublished":"2017-07-05","dateModified":"2018-12-19","parent":{"__typename":"Category","title":"Offline"},"breadcrumbs":[{"title":"How-To Guides","slug":"how-to"},{"title":"Offline","slug":"how-to/offline"},{"title":"Using MyCrypto For Cold Storage","slug":"how-to/offline/using-mycrypto-for-cold-storage"}]},"file":{"childMarkdownRemark":{"html":"<h2>Preface</h2>\n<p>The following assumes you are <strong>not</strong> using a Ledger or TREZOR hardware wallet. Due to their ease of use and security, <a href=\"/staying-safe/hardware-wallet-recommendations\">we recommend a hardware wallet for cold storage</a>.</p>\n<p>To save / backup your Ledger or TREZOR device, simply write down the 24-word phrase on the card they provide and keep it very, very safe. Never put this key on an online device or type it in to MyCrypto.com.</p>\n<p>You can run MyCrypto.com on your computer and this computer can be a cold-storage or offline computer. This means it is a computer that is not connected to the internet and <em>will never be connected to the internet again.</em> You can generate a wallet completely offline &#x26; send Ether or Tokens from the \"View &#x26; Send\" page.</p>\n<h2>How to</h2>\n<ul>\n<li>\n<p>First off, follow our guide on <a href=\"/how-to/offline/how-to-run-mycrypto-offline-and-locally\">running MyCrypto offline and locally</a>.</p>\n</li>\n<li>\n<p>Open the \"Create New Wallet\" tab in the MyCrypto desktop application. Click \"Generate a Keystore File\".</p>\n</li>\n<li>\n<p>Enter a strong but easy to remember password. Do not forget it.</p>\n<ul>\n<li>*This encrypts (protects) your private key. It does not generate your private key. This password alone will <strong>not</strong> be enough to access your Ether.*</li>\n</ul>\n</li>\n<li>\n<p>Click the <code>\"Generate New Wallet\"</code> button.</p>\n</li>\n<li>\n<p>Download your <code>Keystore / UTC file</code> &#x26; save this file to a USB drive.</p>\n<ul>\n<li><em>This is the encrypted version of your private key. You need the password to access it. It is safer than your unencrypted private key but you must have your password to access it in the future.</em></li>\n</ul>\n</li>\n<li>\n<p>Read the warning. If you understand it, click the <code>\"Continue\"</code> button.</p>\n</li>\n<li>\n<p>Print your paper wallet backup and/or <em>carefully</em> hand-write the <code>private key</code> on a piece of paper.</p>\n<ul>\n<li><em>If you are writing it, it is recommended you write it 2 or 3 times. This decreases the chance your messy handwriting will prevent you from accessing your wallet later.</em></li>\n</ul>\n</li>\n<li>\n<p>Copy &#x26; paste your address into a text document somewhere. Get it to your primary, online computer.</p>\n<ul>\n<li><em>Use the QR code or a different USB drive. It is best if you do not hand-write it</em></li>\n<li><em>Search your address on <a href=\"https://etherscan.io/\" target=\"_blank\" rel=\"noopener noreferrer\">Etherscan</a>. Bookmark this page. This is how you will view your balance at any time</em></li>\n</ul>\n</li>\n<li>\n<p>Send a small amount of Ether (0.0001 ETH) from an exchange or another wallet to your new offline wallet.</p>\n</li>\n<li>\n<p>On your offline device, unlock your wallet from the Keystore / UTC file on your USB drive or via the private key that you printed out.  Ensure it unlocks the wallet you are sent to and matches the bookmark you have.</p>\n<ul>\n<li><em>Do not simply leave your new wallet open. Pretend you are coming back a year later to access your riches. Can you do it?</em></li>\n</ul>\n</li>\n<li>\n<p>Send a small amount of Ether (0.00001 ETH) from this new wallet to another address.</p>\n<ul>\n<li><em>Perhaps our donation address? We are a free, open-source service. There are no fees, no ads, no tracking, no cookies, no selling your data.</em></li>\n</ul>\n</li>\n<li>\n<p>Ensure you have recorded all necessary bits of information and the addresses match at all times. If they don't, you mis-wrote something somewhere. That means it's time to start from the beginning in order to make sure you never lose access to your funds.</p>\n</li>\n</ul>\n<p>Doing all of this is tedious, but it ensures you (1) have complete access to your funds (2) the address you sent to is correct and matches the private key you have saved and (3) you can rest easily for years to come, knowing you will be able to access your ETH later.</p>\n<hr>\n<h2>Safe storage of backups</h2>\n<p>It is recommended that you store backups of both forms of your key (the keystore file version and paper wallet version) in physically separate, offline environments.</p>\n<p>This prevents loss of the private key &#x26; password due to: dead hard drive, lost USB drive, wet piece of paper, etc. Keep in mind that physical loss can affect an entire area (e.g. fire, flood).</p>\n<h3>We cannot recover your key</h3>\n<p>MyCrypto is not a web wallet and cannot recover your private key or password, access your account, move funds, recover funds, nor cancel/reverse transactions.</p>\n<p>We are a client-side interface that allows you to interact with the Ethereum blockchain. Please secure &#x26; back up your key like the millions of dollars it could someday be worth.</p>\n<h3>Related articles</h3>\n<ul>\n<li><a href=\"/general-knowledge/ethereum-blockchain/difference-between-wallet-types\">What is the difference between private key &#x26; Keystore / UTC file?</a></li>\n<li><a href=\"/staying-safe/protecting-yourself-and-your-funds\">Protecting yourself and your funds</a></li>\n</ul>"}}},"pageContext":{"slug":"how-to/offline/using-mycrypto-for-cold-storage","file":"how-to/offline/using-mycrypto-for-cold-storage.md"}}