{"data":{"site":{"siteMetadata":{"title":"MyCrypto Knowledge Base"}},"category":{"title":"ENS","slug":"how-to/ens","description":"TODO","childrenCategory":[],"breadcrumbs":[{"title":"How-To Guides","slug":"how-to"},{"title":"ENS","slug":"how-to/ens"}]},"allCategory":null,"allPage":{"edges":[{"node":{"title":"Visual Guide to Buying Vanity Ethereum Addresses with ENS and MyCrypto","slug":"how-to/ens/visual-guide-to-buying-vanity-ethereum-addresses-with-ens-and-mycrypto","excerpt":" The following was taken from Edward T Giraffe via hackernoon.com. \"Nothing says 'I’m serious about Ethereum' like your name on the blockchain\" Link to Visual Guide to Buying Ethereum Addresses with..."}},{"node":{"title":"Manually Revealing ENS Bids (Hard)","slug":"how-to/ens/manually-revealing-ens-bids-hard","excerpt":" Use our tool... More easily debug, generate, reveal, and finalize data: https://legacy.mycrypto.com/helpers.html Get the transaction ID of your original bid Under \"input data\" it should look like:..."}},{"node":{"title":"Releasing ENS names","slug":"how-to/ens/releasing-ens-names","excerpt":" How to release Your ENS name after a year Navigate to MyCrypto's contracts tab . In the Select Existing Contract dropdown, select the ENS: ETH Registrar (Auction) option. Here is a picture of where ..."}},{"node":{"title":"Brute-Forcing Secret Word Phrases","slug":"how-to/ens/brute-forcing-secret-word-phrases","excerpt":" The following is from /u/eth-o-licious2 on reddit Recently, I was trying to reveal one of my bids and realized that somehow I failed to copy down my three-word secret from MyCrypto, probably because..."}},{"node":{"title":"Starting an Auction without Bidding","slug":"how-to/ens/starting-an-auction-without-bidding","excerpt":" You can open an auction without bidding. It's not the simplest thing in the world, but it's not the worst. It looks harder than it is: Go to https://legacy.mycrypto.com/helpers.html. Find NS Debugg..."}},{"node":{"title":"Manually revealing your ENS bid","slug":"how-to/ens/manually-revealing-your-ens-bid","excerpt":" Get your bid transaction hash First, look up your address on Etherscan in order to find the transaction in which you placed your bid. Look for: An outgoing transaction (orange) To ENS-Registrar Wit..."}},{"node":{"title":"Importing a bid created in MyCrypto into ENS and vice-versa","slug":"how-to/ens/importing-a-bid-created-in-mycrypto-into-ens-and-vice-versa","excerpt":" The fields of the JSON files created by MyCrypto and ENS (registrar.ens.domains) appear to be different but in fact they have different names and styles for the same thing. Here is a comparison of t..."}},{"node":{"title":"What to do if you forgot how much you bid","slug":"how-to/ens/what-to-do-if-you-forgot-how-much-you-bid","excerpt":" First, look up your address on Etherscan in order to find the transaction in which you placed your bid. Look for: An outgoing transaction (orange) To ENS-Registrar With an ETH value > 0.01 ETH (not ..."}},{"node":{"title":"Changing the ENS owner or transferring an ENS Name","slug":"how-to/ens/changing-the-ens-owner-or-transferring-an-ens-name","excerpt":" Transferring a domain (best practice!) Search for your domain on Etherscan Copy the Label Hash. Go to the Contracts page and select ENS - Eth Registrar (Auction) 0x6090a6e47849629b7245dfa1ca21d94cd1..."}},{"node":{"title":"Setting the resolver for an ENS name","slug":"how-to/ens/setting-the-resolver-for-an-ens-name","excerpt":" Set the resolver for your name Go to the contracts tab. Choose ENS - Registry: 0x314159265dD8dbb310642f98f50C066173C1259b. Click \"Access\". Select setResolver. Find your name on etherscan.io and copy..."}},{"node":{"title":"What to do if You Forgot to Reveal Your ENS Bid","slug":"how-to/ens/what-to-do-if-you-forgot-to-reveal-your-ens-bid","excerpt":" If there are other bidders You can get 0.5% back by manually revealing, as written up here. Unfortunately, you must reveal during the reveal period in order to win the name or get the full amount ba..."}}]}},"pageContext":{"slug":"how-to/ens"}}