{"data":{"page":{"title":"Checking or replacing a transaction after it's been sent","slug":"how-to/sending/checking-or-replacing-a-transaction-after-it-has-been-sent","originalSlug":"how-to/sending/checking-or-replacing-a-transaction-after-it-has-been-sent","description":"Transactions","datePublished":"2017-10-08","dateModified":"2018-12-19","parent":{"__typename":"Category","title":"Sending"},"breadcrumbs":[{"title":"How-To Guides","slug":"how-to"},{"title":"Sending","slug":"how-to/sending"},{"title":"Checking or replacing a transaction after it's been sent","slug":"how-to/sending/checking-or-replacing-a-transaction-after-it-has-been-sent"}]},"file":{"childMarkdownRemark":{"html":"<h2>How can I check on the status of my transaction?</h2>\n<ul>\n<li><a href=\"https://etherscan.io/txsPending\" target=\"_blank\" rel=\"noopener noreferrer\">Etherscan's Pending Transactions</a></li>\n<li><a href=\"https://mycrypto.com/tx-status\" target=\"_blank\" rel=\"noopener noreferrer\">Our Check Transaction Status Tab</a></li>\n</ul>\n<h2>Canceling or replacing a transaction</h2>\n<p>Can I cancel, override, overwrite, replace, or do anything else once a transaction has been sent?</p>\n<p>Most of the time the answer is <strong>NO</strong>.</p>\n<p>Once a transaction has been mined and is included in a block on the blockchain, it cannot be canceled or replaced.</p>\n<p>During times of normal volume, transactions are mined within seconds and do not spend any length of time in the transaction pool. There is simply not enough time to cancel, replace, or override a transaction once it has been sent.</p>\n<p>However...</p>\n<p>During times of extremely high volume (like we've seen during the Bancor and Status Token Contribution periods), transactions could be pending for hours, if not days, before being mined.</p>\n<p>During these times, it is theoretically possible to replace an existing transaction with a new transaction that has a higher gas price.</p>\n<p>The second transaction, theoretically, will be mined before the first transaction, effectively \"canceling\" the first transaction.</p>\n<p>The easiest way to do this is by sending a <code>0 ETH</code> transaction to <code>your own address</code> with the same nonce and higher gas price. This will \"cancel\" your first transaction.</p>\n<p>There is no guarantee this will work, nor that it will work every time. This tool is very, very new. Please use at your own risk.</p>\n<hr>\n<p>Do not take this article or any feature on MyCrypto as an indication that you can cancel a transaction that you accidentally sent to the wrong address or that you can get your ETH back once it has been sent.</p>\n<p>This article <strong>only</strong> applies to finding, checking, and <em>potentially</em> replacing transactions that have been stuck in the transaction pool for a very long period of time.</p>\n<hr>\n<h2>How to check the status of a transaction</h2>\n<ol>\n<li>\n<p>Go to our <a href=\"https://mycrypto.com/tx-status\" target=\"_blank\" rel=\"noopener noreferrer\">Check TX Status</a> page.</p>\n</li>\n<li>\n<p>Copy and paste the transaction hash into the field provided.</p>\n</li>\n<li>\n<p>Click the <code>Check TX Status</code> button.</p>\n</li>\n<li>\n<p>Details will appear depending on the state of the transaction. It could be...</p>\n<ul>\n<li>\n<p><strong>Transaction Found:</strong> Your transaction was successfully mined and is on the blockchain. Click the link provided.</p>\n</li>\n<li>\n<p>If you see a red ( ! ) symbol, or a \"BAD INSTRUCTION\" or \"OUT OF GAS\" error message, it means that the transaction was not successfully <em>sent</em>. You cannot cancel or replace this transaction. Instead, send a new transaction. If you received an \"Out of Gas\" error, you should double the gas limit you specified originally.</p>\n</li>\n<li>\n<p>If you do not see any errors, your transaction was successfully sent. Your ETH or tokens are where you sent them. If this balance has not been credited to your hosted wallet or exchange account within 24 hours after sending, please <a href=\"/general-knowledge/ethereum-blockchain/more-help-support-and-communities\">contact that service</a>. Send them the <em>link</em> to your transaction and ask them, nicely, to look into your situation.</p>\n</li>\n<li>\n<p><strong>Transaction Not Found:</strong> This transaction cannot be found in the TX pool of the node you are connected to. However, it could be in a different TX pool, waiting to be mined. Please use the dropdown in the upper right to select a different ETH node (e.g., <code>ETH (Etherscan.io)</code> or <code>ETH (Infura.io)</code> or <code>ETH (MyCrypto)</code>) and check again.</p>\n</li>\n<li>\n<p><strong>Pending Transaction Found:</strong> Your transaction was located in the TX pool of the node you are connected to. It is currently pending (waiting to be mined). There is a chance you can cancel or replace this transaction.</p>\n</li>\n</ul>\n</li>\n</ol>\n<h2>\"Replacing\" vs \"Canceling\" transactions</h2>\n<ul>\n<li><strong>Canceling</strong>: Generating a <code>0 ETH</code> transaction to <code>Your Own Address</code> with the purpose of preventing a previous transaction from \"going through\" / \"being mined\" / being included in the blockchain.</li>\n<li><strong>Replacing</strong>: Generating a <code>XX ETH</code> transaction to <code>Someone Else's Address</code> with the purpose of doing something (e.g., sending, revealing an ENS bid) <em>while simultaneously</em> not having a previous transaction go through.</li>\n</ul>\n<p>The reason we recommend <code>Canceling</code> over  <code>Replacing</code> is that it is not guaranteed your second transaction will actually replace your first one. Your first transaction could still be mined first, invalidating your second transaction. Choosing to replace a transaction with a new one could lead to more confusion, headaches, and pending ETH, or ETH spent unnecessarily in the form of gas. This is especially true if your first transaction is mined anyways, which is possible.</p>\n<h3>Canceling a transaction</h3>\n<p><strong>Canceling</strong> means generating a <code>0 ETH</code> transaction to <code>Your Own Address</code> with the purpose of preventing a previous transaction from \"going through\" / \"being mined\" / \"being included in the blockchain\" / \"being stuck.\"</p>\n<ol>\n<li>\n<p>Go to <a href=\"https://mycrypto.com/tx-status\" target=\"_blank\" rel=\"noopener noreferrer\">https://mycrypto.com/tx-status</a>.</p>\n</li>\n<li>\n<p>Paste your TX hash.</p>\n<ul>\n<li>If it says pending, you can cancel it.</li>\n<li>If it says not found, click the button again, waiting a few seconds between each click. This will poll different nodes. If that doesn't work, change the network in the top-right corner to Etherscan, Infura, MyCrypto, and Giveth and check for the TX hash each time you switch.</li>\n<li>If it says found, you cannot cancel it.</li>\n</ul>\n</li>\n<li>\n<p>If it says pending, unlock the wallet you used to send the original transaction.</p>\n</li>\n<li>\n<p>Don't change any fields. These are already filled in for you. If you change something, it will not work as intended, bad things could happen and you will have no one to blame but yourself.</p>\n</li>\n<li>\n<p>Click the <code>Send Transaction</code> Button.</p>\n</li>\n<li>\n<p>A dialog will appear. Click the \"Yes, I'm Sure\" button to send.</p>\n</li>\n<li>\n<p>A new <code>TX Hash</code> will appear in the green bar across the bottom. Click the link to view it and see if you were successful. If it doesn't show up immediately, stop. Breath. Count to 20. <em>Then</em> click refresh.</p>\n</li>\n</ol>\n<h3>Replacing a transaction (for advanced users only)</h3>\n<p><strong>Replacing</strong>: Generating a <code>XX ETH</code> transaction to <code>Someone Else's Address</code> with the purpose of doing something (e.g., sending, revealing an ENS bid) <em>while simultaneously</em> not having a previous transaction go through.</p>\n<ol>\n<li>Unlock the wallet you used to send the original transaction.</li>\n<li><strong>To Address:</strong> Replace the address with whatever address you wish to send to.</li>\n<li><strong>Amount:</strong> Change from <code>0</code> to the amount of ETH you wish to send.</li>\n<li><strong>Gas Limit:</strong> If sending a standard ETH transaction, you can use <code>21000</code>. Sending tokens is ~<code>200000</code>. Otherwise, just leave as is.</li>\n<li><strong>Gas Price:</strong> This field is already pre-filled with <code>Gas Price of Previous Transaction</code> + <code>10 GWEI</code>. Leave as is, unless this is super duper urgent, then you may choose to raise it. Keep in mind, the higher the gas price, the higher the TX fee (<code>Gas Limit</code> * <code>Gas Price</code>). Be careful!</li>\n<li><strong>Nonce:</strong> Leave as is. If you change this, it will not replace the transaction you are hoping it will replace.</li>\n<li>Click the <code>Send Transaction</code> Button.</li>\n<li>A dialog will appear. Carefully review all information displayed. Click the \"Yes, I'm Sure\" button to send.</li>\n<li>A new <code>TX Hash</code> will appear in the green bar across the bottom. Click the link to view it and see if you were successful. If it doesn't show up immediately, stop. Breath. Count to 20. <em>Then</em> click refresh.</li>\n</ol>\n<h2>Final notes</h2>\n<ul>\n<li>The TX fee is NOT paid to us — it is paid to the miners for including your transaction in a block. We are still a free, open-source service.</li>\n<li>The TX pool varies from node to node. This means that a TX may be pending in <code>ETH (Infura.io)</code>'s TX pool, but <em>not</em> <code>ETH (MyCrypto)</code>'s TX pool. For this reason, you should try all three nodes we offer.</li>\n<li>If possible, use the same computer / browser that you used to send the transaction. We are working on further mitigating internal differences between our 10 nodes and their 10 TX pools. For now, using the same computer / browser will increase the likelihood you connect to the same as before if you are using the <code>ETH (MyCrypto)</code> node.</li>\n</ul>\n<h2>Related articles</h2>\n<ul>\n<li><a href=\"/general-knowledge/ethereum-blockchain/what-is-gas\">You can learn more about gas &#x26; gas limit vs gas price here.</a></li>\n<li><a href=\"/general-knowledge/ethereum-blockchain/what-is-nonce\">You can learn more about nonce here</a></li>\n</ul>"}}},"pageContext":{"slug":"how-to/sending/checking-or-replacing-a-transaction-after-it-has-been-sent","file":"how-to/sending/checking-or-replacing-a-transaction-after-it-has-been-sent.md"}}