{"data":{"site":{"siteMetadata":{"title":"MyCrypto Knowledge Base"}},"category":{"title":"For Developers / Contributors","slug":"developers","description":"TODO","childrenCategory":[],"breadcrumbs":[{"title":"For Developers / Contributors","slug":"developers"}]},"allCategory":null,"allPage":{"edges":[{"node":{"title":"How To Report A Bug","slug":"developers/reporting-a-bug","excerpt":" Reporting a Bug If you've found a bug, or something confusing about MyCrypto, here's what you should do: Search for your issue - If you're experiencing something, the chances are good that someone ..."}},{"node":{"title":"How to suggest a feature","slug":"developers/suggesting-a-feature","excerpt":" If there's a feature that you think would make MyCrypto a better product, we want to know. Here's the best way to tell us: Search for your suggestion - If you've thought of a good new feature,     c..."}},{"node":{"title":"How to Submit a Pull Request","slug":"developers/how-to-submit-pull-request","excerpt":" Navigate to the file you would like to modify. Login or join GitHub. Click the pencil icon in upper right. Make the changes you want to make. At the bottom under \"Commit changes,\" write a short descr..."}},{"node":{"title":"How can I help with translations?","slug":"developers/how-can-i-help-translate","excerpt":" Providing Translations Our team is somewhat multi-lingual, but we rely on the community to help out with languages we don't know. If you're willing to help, we'd really appreciate it. Find your lan..."}},{"node":{"title":"How Can I Help Contribute Code?","slug":"developers/contributing-code","excerpt":" If you're a developer looking to pitch in, you're more than welcome to help out. Here are some suggestions for diving in: Read the Documentation Make sure you read the entire Readme to understand s..."}},{"node":{"title":"Adding Support for a Web3 Wallet","slug":"developers/adding-support-for-web3-wallet","excerpt":" Identifying Your Provider If you're a web3 wallet developer or user, you'll definitely want to have people see your name and logo when they browse MyCrypto with your browser: It's easy to make that..."}},{"node":{"title":"Adding a New Network to MyCrypto","slug":"developers/adding-a-new-network","excerpt":" Adding support for your Ethereum-like network is easy, assuming it isn't significantly different from the Ethereum network. To make sure your network is well supported, we require the following: Mus..."}},{"node":{"title":"Adding Your Token as a Default Token","slug":"developers/add-token-to-default-list","excerpt":" If you are experimenting with tokens, you can add a token to your local version of MyCrypto. MyCrypto ships with a default token list that allows our Token Scanner functionality to check balances fo..."}},{"node":{"title":"Running MyCrypto With Your Own Personal Node","slug":"developers/run-your-own-node-with-mycrypto","excerpt":" You can use MyCrypto to connect to your own node, which decouples the frontend and features that you love about MyCrypto from our backend infrastructure. This means more nodes send more transactions ..."}}]}},"pageContext":{"slug":"developers"}}