{"data":{"site":{"siteMetadata":{"title":"MyCrypto Knowledge Base"}},"category":{"title":"Sending","slug":"troubleshooting/sending","description":"TODO","childrenCategory":[],"breadcrumbs":[{"title":"Troubleshooting Issues","slug":"troubleshooting"},{"title":"Sending","slug":"troubleshooting/sending"}]},"allCategory":null,"allPage":{"edges":[{"node":{"title":"Error: Unable to Locate Corresponding Transfer Event Log","slug":"troubleshooting/sending/errcode-unable-to-locate-corresponding-transfer-event-log","excerpt":" Why does this keep happening?! This error appears on Etherscan when a sender tries to transfer out more tokens than they have. Generally, this can happen due to a few possible events: When adding ..."}},{"node":{"title":"Transaction Failed: TX Fee not Refunded","slug":"troubleshooting/sending/transaction-fee-not-refunded","excerpt":"\"Why didn't I get my transaction fee (TX Fee) back, even though my transaction failed?\"* Ethereum is the network—the blockchain. Ether (ETH) is the fuel for that network. When you send tokens, intera..."}},{"node":{"title":"Transaction Failed: Out of Gas","slug":"troubleshooting/sending/transaction-failed-out-of-gas","excerpt":" Each transaction (TX) on the Ethereum blockchain (including token and contract transactions) requires gas, which is paid in Ether. You can think of this as a transaction fee. The more computational e..."}},{"node":{"title":"Error: Cannot send due to insufficient funds","slug":"troubleshooting/sending/error-insufficient-funds-message","excerpt":" If you are getting the error, \"WARNING: Your ether or token balance isn't high enough to complete this transaction. Please send more funds or switch to a different wallet.\", it means you do not have ..."}},{"node":{"title":"ETH or Tokens sent to or from exchange haven't shown up","slug":"troubleshooting/sending/eth-or-tokens-not-showing-on-exchange","excerpt":" First, check the transaction on Etherscan or Etherchain, and ensure that there is no red ( ! ) symbol by the transaction. Successful transactions Example from Etherscan Example from Etherchain Uns..."}},{"node":{"title":"Error: 'Not Checksummed' When Entering Address","slug":"troubleshooting/sending/not-checksummed-shows-when-i-enter-an-address","excerpt":" What is a checksummed address? A checksummed address is an address that contains uppercase letters, as specified in EIP-55. Checksummed addresses are meant to help prevent users from sending transac..."}},{"node":{"title":"What to do if you sent to the wrong address","slug":"troubleshooting/sending/what-to-do-if-you-sent-to-wrong-address","excerpt":" MyCrypto is not a \"web wallet.\" You do not create an account or give us your ETH or tokens to hold onto. We are simply an interface that allows you to easily interact with cryptocurrency. In order t..."}},{"node":{"title":"Transaction has a 'Bad Jump Destination' or 'Out of Gas' Error","slug":"troubleshooting/sending/error-bad-jump-destination-or-out-of-gas-error","excerpt":"My transaction has a Bad jump destination or Out of Gas error. When do I get my ETH back? When a transaction fails due to a Bad jump destination or Out of Gas error, the ETH never actually leaves you..."}},{"node":{"title":"Balances Not Loading or Showing on MyCrypto","slug":"troubleshooting/sending/ethereum-balance-not-loading-or-showing","excerpt":" This is most likely due to the fact that either you are behind a firewall, you have refreshed the page a bunch of times and hit your hourly API limit, or our nodes are under extreme strain and are re..."}},{"node":{"title":"Transactions Not Showing Up or Pending Forever","slug":"troubleshooting/sending/transactions-not-showing-or-pending","excerpt":" At times, combinations of new users, increased interest, popular apps like CryptoKitties, and misc. ICOs can create quite a mess of the transaction (TX) pool. This sometimes results in an accumulatio..."}}]}},"pageContext":{"slug":"troubleshooting/sending"}}