{"data":{"page":{"title":"Protecting Yourself and Your Funds","slug":"staying-safe/protecting-yourself-and-your-funds","originalSlug":"staying-safe/protecting-yourself-and-your-funds","description":"Getting Started","datePublished":"2015-07-15","dateModified":"2018-12-19","parent":{"__typename":"Category","title":"How to Stay Safe"},"breadcrumbs":[{"title":"How to Stay Safe","slug":"staying-safe"},{"title":"Protecting Yourself and Your Funds","slug":"staying-safe/protecting-yourself-and-your-funds"}]},"file":{"childMarkdownRemark":{"html":"<h2>1. Get yourself a hardware wallet.</h2>\n<p>One of the safest and easiest ways to store your ETH, Tokens, ETC, BTC, and many other coins is via a <strong>Ledger Nano S</strong> or <strong>TREZOR</strong>. Both are hardware wallets. Both work with MyCrypto.com and both cost less than $100.</p>\n<ul>\n<li><a href=\"https://www.ledgerwallet.com/r/1985?path=/products/\" target=\"_blank\" rel=\"noopener noreferrer\">Buy a Ledger</a></li>\n<li><a href=\"https://shop.trezor.io/?offer_id=10&#x26;aff_id=1735\" target=\"_blank\" rel=\"noopener noreferrer\">Buy a Trezor</a></li>\n<li><a href=\"http://keepkey.go2cloud.org/aff_c?offer_id=1&#x26;aff_id=4086\" target=\"_blank\" rel=\"noopener noreferrer\">Buy a Keepkey</a></li>\n</ul>\n<p>If you don't want one of these nifty devices, use <a href=\"/how-to/offline/using-mycrypto-for-cold-storage\">cold storage</a> for a majority of your savings. Please. Pretty please.</p>\n<h2>2. Bookmark your crypto sites.</h2>\n<p>Use those bookmarks and only those. Don't type in the addresses by hand.</p>\n<h2>3. Install EAL or MetaMask.</h2>\n<p>Install the <a href=\"https://chrome.google.com/webstore/detail/etheraddresslookup/pdknmigbbbhmllnmgdfalmedcmcefdfn\" target=\"_blank\" rel=\"noopener noreferrer\">EAL Chrome Extension</a> or the <a href=\"https://chrome.google.com/webstore/detail/metamask/nkbihfbeogaeaoehlefnkodbefgpgknn\" target=\"_blank\" rel=\"noopener noreferrer\">MetaMask Chrome Extension</a> to warn you if you go to a crypto-phishing link.</p>\n<h2>4. <a href=\"/how-to/offline/how-to-run-mycrypto-offline-and-locally\">Use MyCrypto locally and offline</a>.</h2>\n<h2>5. Do not trust random URLs.</h2>\n<p>Do not trust communications, addresses, or URLs sent via private message. Always verify information with a secondary source.</p>\n<ul>\n<li>Don’t click any link related to anything crypto, money, banking, or services like Dropbox / Google Drive / Gmail in any email ever.</li>\n<li>And if the scammy clickbait was simply too irresistible for you, don’t enter any information on the page.</li>\n<li>Never enter your private keys, passwords, or sensitive data on a website that you were sent via message.</li>\n</ul>\n<h2>6. Turn on 2FA for everything.</h2>\n<ul>\n<li>Go do it. Right now. Quit your excuses. Choose Google Authenticator over Authy. Don't use your phone number. Then, make sure your phone number is NOT tied to your Google account (look in privacy settings). Turns out, you and your BFF Mr. Hacker can \"recover\" access to your account via that number, completely destroying the point of 2FA.</li>\n<li>PS: MyCrypto is client-side, meaning 2FA won't do anything in our case. 2FA is for ensuring the security of your password on a server.</li>\n<li>PSS: Don't forget to cold store your backup words for these 2FA things. It's a huge pain when your phone goes for a swim and your entire life is 2FA'd.</li>\n</ul>\n<h2>7. For token sales:</h2>\n<p>Do not trust any address except the one posted on the official site.</p>\n<ul>\n<li>Bookmark the URL before the sale. Get the address of the URL from your bookmark at time of purchase. Do not trust any other source (especially a bot on Slack). PS: When are token sales going to start using ENS names?</li>\n</ul>\n<h2>8. Double-check the URL and triple-check GitHub URLs</h2>\n<ul>\n<li>Check it. Then, check it again right before entering any information. This is especially important for any sites that require usernames, passwords, email addresses, private keys, or any other personal information. SSL certs do not mean a site is trustworthy, just that they bought an SSL cert. Not sure about the correct URL? Cross-reference Reddit, Twitter, GitHub, Slack and wherever else the project hangs out.</li>\n<li>GitHub URLs are much easier to fake and much easier to miss. Instead of downloading from that unverified URL on Reddit, seek out the URL on your own. Following the developers of these repos on Twitter, friending them on Reddit (lol ... but seriously it's nice because their name will be orange), or starring said repos on GitHub helps.</li>\n</ul>\n<h2>9. Always verify that the site you landed on is legit.</h2>\n<ul>\n<li>Especially if you are about to enter your private key or download an application. What is legit? A service that people have used for a decent period of time with good results. If the URL has been registered in the last week or the site \"just launched,\" err on the side of caution and avoid it for a while.</li>\n</ul>\n<h2>10. Google the service name + \"scam\" or \"reviews.\"</h2>\n<ul>\n<li>Scam sites rarely last long. Value real comments by real people over a random blog. Value a collection of information over a single source. Understand that legit services will likely have a mix of positive and negative reviews over a long period of time. Scam sites typically have either no one talking about them at all, a lot of yelling about how people got robbed, or the most perfect reviews ever. The latter one is just as much of a red flag as the first one.</li>\n</ul>\n<h2>11. Don't run remote-access software (e.g., TeamViewer).</h2>\n<ul>\n<li>Don't ever ... but especially not on a computer with keys on them. The number of security holes in these programs is atrocious. It would be a shame if you enabled 2FA on everything in your life but then let a single string of characters give someone access to your entire computer and every account.</li>\n</ul>\n<h2>12. Don't use brain wallets.</h2>\n<ul>\n<li>Brain wallets are wallets where the key is derived from a word or phrase you <em>choose</em>. Human brains don't have the ability to create high-entropy seeds. Using a phrase that you make up, even if it seems \"rare\" or \"random\" is not as secure as using MyCrypto's randomness, and these phrases can be brute-forced by the millions. <a href=\"https://arstechnica.com/security/2013/10/how-the-bible-and-youtube-are-fueling-the-next-frontier-of-password-cracking/\" target=\"_blank\" rel=\"noopener noreferrer\">Read more</a>. <a href=\"https://arstechnica.com/security/2016/02/password-cracking-attacks-on-bitcoin-wallets-net-103000/\" target=\"_blank\" rel=\"noopener noreferrer\">And more</a>.  </li>\n</ul>\n<h2>13. Install a good adblocker.</h2>\n<p>Install an adblocker that actually turns off Google and Bing ads.</p>\n<ul>\n<li>We recommend going with uBlock Origin. If you are already using Adblock Plus, it does not hide Google Ads from you. Go into your Adblock Plus settings and uncheck the box that says “Allow some non-intrusive advertising.”</li>\n</ul>\n<h2>14. Don’t click on advertisements.</h2>\n<ul>\n<li>With or without an adblocker, you should never, ever click on advertisements.</li>\n</ul>\n<h2>15. Clean out your history.</h2>\n<p>If you have accidentally visited or typed a malicious site, clean out your recent history and autocomplete.</p>\n<ul>\n<li>This will prevent you from typing kra… and having it autocomplete to the malicious krakken.com.</li>\n</ul>\n<h2>16. No one is giving you free or discounted ETH.</h2>\n<ul>\n<li>Even for completing a survey. ;)</li>\n</ul>\n<h2>17. Don't trust Slack DMs.</h2>\n<p>The guys who just finished their token sale don't want to sell you tokens via Slack DM.</p>\n<ul>\n<li>Neither does that smokin' hot 125px x 125px avatar.</li>\n</ul>\n<h2>18. Don't unlock your account to check your balance.</h2>\n<p>ONLY unlock your wallet when you want to send a transaction. Check your balance via <a href=\"https://etherscan.io/\" target=\"_blank\" rel=\"noopener noreferrer\">Etherscan</a>, <a href=\"https://ethplorer.io/\" target=\"_blank\" rel=\"noopener noreferrer\">Ethplorer</a>, or <a href=\"https://www.etherchain.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Etherchain</a>.</p>\n<h2>19. Lastly: Use your brain.</h2>\n<ul>\n<li>Think for a moment. Don't assume—ask. Don't blindly follow—question. If something doesn't seem right, if you feel like the luckiest person on Earth, or if you find yourself pondering, \"I wonder why I haven't seen this on Reddit yet,\" there is likely a reason.</li>\n</ul>"}}},"pageContext":{"slug":"staying-safe/protecting-yourself-and-your-funds","file":"staying-safe/protecting-yourself-and-your-funds.md"}}