{"data":{"page":{"title":"A glossary of common terms in the Ethereum and crypto space","slug":"general-knowledge/ethereum-blockchain/a-glossary-of-common-terms-in-the-ethereum-crypto-space","originalSlug":"general-knowledge/ethereum-blockchain/a-glossary-of-common-terms-in-the-ethereum-crypto-space","description":"Getting Started","datePublished":"2015-10-05","dateModified":"2018-12-19","parent":{"__typename":"Category","title":"The Ethereum Blockchain"},"breadcrumbs":[{"title":"General Knowledge","slug":"general-knowledge"},{"title":"The Ethereum Blockchain","slug":"general-knowledge/ethereum-blockchain"},{"title":"A glossary of common terms in the Ethereum and crypto space","slug":"general-knowledge/ethereum-blockchain/a-glossary-of-common-terms-in-the-ethereum-crypto-space"}]},"file":{"childMarkdownRemark":{"html":"<h2>Words are Hard</h2>\n<p>This is a list of terms you might encounter when using the MyCrypto interface.</p>\n<hr>\n<h3>Asset</h3>\n<ul>\n<li>MyCrypto uses the umbrella term “asset” to refer to any cryptocurrency or token. </li>\n</ul>\n<h3>Cryptocurrency</h3>\n<ul>\n<li>A digital store of value that uses complex cryptography to secure financial transactions, control the creation of additional units, and/or verify the transfer of other assets or property. </li>\n<li>Possession of cryptocurrencies and their activity are tracked using immutable distributed ledger technology, most commonly in the form of blockchains. </li>\n<li>The values of cryptocurrencies vary drastically and in many cases are volatile. In the case of Ether, it is also used as payment (gas) for the computational resources required to run an application (or dapp).</li>\n</ul>\n<h3>Wallet</h3>\n<ul>\n<li>The interface / client / wrapper / holder that you use to manage your account(s).</li>\n<li>Example: MyCrypto.com, your Ledger hardware wallet, a Multisig wallet contract.</li>\n</ul>\n<h3>Account</h3>\n<ul>\n<li>A public and private key pair that \"holds\" your funds.</li>\n<li>Your funds are actually stored on the blockchain, not in the wallet or account.</li>\n<li>Just like your Reddit account has a <code>username (public)</code> and <code>password (private)</code>, so does your Ethereum account. For additional security, you can use a password to encrypt your private key which would result in a <code>username (public)</code> and <code>password (private)</code> and <code>password for that password (private + more secure)</code>. See the <code>Keystore File</code> section.</li>\n</ul>\n<h3>Address <em>(\"Public Key\")</em></h3>\n<ul>\n<li>You use this to send funds <strong>to</strong> an account.</li>\n<li>Sometimes referred to as the \"public key.\"</li>\n<li>A string made up of <code>0x</code> + <code>40 hexadecimal characters</code>.</li>\n<li>In Ethereum, the address begins with <code>0x</code>.</li>\n<li>Example: <code>0x06A85356DCb5b307096726FB86A78c59D38e08ee</code>.</li>\n<li>This functions similarly to an email address.</li>\n</ul>\n<h3>Public Key</h3>\n<ul>\n<li>In cryptography, you have a key pair: the public and private key.</li>\n<li>You can derive a public key from a private key, but cannot derive a private key from a public key.</li>\n<li>(Advanced) In Ethereum, the address \"acts\" like the public key, but it's not actually the public key.</li>\n<li>(Advanced) In Ethereum, the public key is derived from the private key and is 128 hex characters. You then take the <code>\"SHA3\" (Keccak-256)</code> hash of this (64 characters), take the last 40 characters, and prefix that with <code>0x</code>, resulting in your 42-character address.</li>\n</ul>\n<h3>Private Key</h3>\n<ul>\n<li>You use this to send funds <strong>from</strong> an account.</li>\n<li>The secret half of your address / public key.</li>\n<li>A string of 64 hexadecimal characters.</li>\n<li>(<a href=\"https://crypto.stackexchange.com/questions/30269/are-all-possible-ec-private-keys-valid\" target=\"_blank\" rel=\"noopener noreferrer\">Almost</a>) every string of 64 hexadecimal characters is a private key.</li>\n<li>If you hand type a private key differently today than yesterday, you will access a different wallet. Never hand type your private key.</li>\n<li>This is the string you need to send from your account. Without it, you cannot access your funds. Although, you don't need to save this raw, unencrypted private key in this format. You can save the fancy versions of it (e.g., the Keystore File / Mnemonic Phrase).</li>\n<li>Example: <code>afdfd9c3d2095ef696594f6cedcae59e72dcd697e2a7521b1578140422a4f890</code>.</li>\n</ul>\n<h3>Keystore File</h3>\n<ul>\n<li>Encrypted version of your private key in JSON format (though it does not have a JSON extension).</li>\n<li>A fancy version of your private key that is protected by a password of your choosing.</li>\n<li>When combined with the password, it has the private key.</li>\n<li>Safer than a private key because you need the password.</li>\n<li>File name usually is in the format <code>UTC</code> + <code>--</code> + <code>DATE_CREATED</code> + <code>--</code> + <code>YOUR_ADDRESS_WITHOUT_THE_OX</code>.</li>\n<li>Example of File Name: <code>UTC--2017-07-02T20-33-09.177Z--06a85356dcb5b307096726fb86a78c59d38e08ee</code>.</li>\n<li>Example of Contents: <code>{\"version\":3,\"id\":\"aa811d53-fe9a-44a2-bd1c-e737007b5591\",\"address\":\"06a85356dcb5b307096726fb86a78c59d38e08ee\",\"Crypto\":{\"ciphertext\":\"f5a7cc8d4b8cf93510b0d0d057f3a52ac79fd48e619e0638c4ffd978ca180248\",\"cipherparams\":{\"iv\":\"975ab00192e2dd74170e91ca59c0b0bd\"},\"cipher\":\"aes-128-ctr\",\"kdf\":\"scrypt\",\"kdfparams\":{\"dklen\":32,\"salt\":\"0210f0d0b99e440dfbceb36373304638bac093a367ee7da6411cd165f7aa907a\",\"n\":1024,\"r\":8,\"p\":1},\"mac\":\"8197a747a3855a10546a2ff939c36470daed78e393b670efa0c12fe3b23dd7e3\"}}</code>.</li>\n<li>(pw: <code>mypassword</code>).</li>\n</ul>\n<h3>Mnemonic Phrase</h3>\n<ul>\n<li>Another fancy version of your private key, which is actually used to derive multiple private keys.</li>\n<li>A (typically) 12- or 24-word phrase that allows you to access an infinite number of accounts.</li>\n<li>Used by Ledger, TREZOR, MetaMask, Jaxx, and others.</li>\n<li>Originates from <a href=\"https://github.com/bitcoin/bips/blob/master/bip-0039.mediawiki\" target=\"_blank\" rel=\"noopener noreferrer\">BIP 39 Spec</a>.</li>\n<li>The accounts you can access with this phrase are determined by the \"path.\"</li>\n<li>Example 12-words: <code>brain surround have swap horror body response double fire dumb bring hazard</code>.</li>\n<li>Example 24-words: <code>card enrich gesture connect kick topple fan body blind engine lemon swarm venue praise addict agent unaware equal bean sing govern income link leg</code>.</li>\n</ul>\n<h3>Hardware Wallet:</h3>\n<ul>\n<li>Typically, a single-purpose device that \"holds\" your private key(s), ensuring your private key(s) are safe.</li>\n<li>Typically, they use a 24-word phrase. This phrase you should write down (not on your computer) and store separately from your hardware wallet.</li>\n<li>If you lose your hardware wallet, you can still gain access to your accounts and funds via the word phrase you wrote down.</li>\n<li>Never type the word phrase on your computer. It defeats the purpose of your hardware wallet.</li>\n<li><a href=\"/how-to/hardware-wallets\">See here for more information about Hardware Wallets</a>.</li>\n</ul>\n<h3>AddressIdenticon / AddressIcon:</h3>\n<ul>\n<li>The colorful blob that corresponds to your address.</li>\n<li>It is an easy way to see if your address is correct.</li>\n<li><a href=\"https://i.imgur.com/lHUrIiZ.jpg\" target=\"_blank\" rel=\"noopener noreferrer\">Example 1</a>.</li>\n<li><a href=\"https://i.imgur.com/FvyLewS.jpg\" target=\"_blank\" rel=\"noopener noreferrer\">Example 2</a>.</li>\n<li><em>Note: the above addresses are a single character different but have remarkably different icons and colors. Magic!</em></li>\n</ul>\n<h3>Hexadecimal</h3>\n<ul>\n<li>Used all over Ethereum for a variety of things, a hexadecimal string is comprised of the numbers <code>0 1 2 3 4 5 6 7 8 9</code> and <code>A B C D E F</code>.</li>\n</ul>\n<h3>Seed</h3>\n<ul>\n<li>The input given to derive a private key. This should always be generated in a truly random way, and not be something you make up with your measly human brain.</li>\n<li>If you chose the seed, it is known as a <code>brain wallet</code>.</li>\n</ul>\n<h3>Brain Wallet</h3>\n<ul>\n<li>An account generated from a seed or password or passphrase of your choosing.</li>\n<li>Humans are not capable of generating enough entropy and therefore the wallets derived from these phrases are insecure.</li>\n<li>Brain wallets can be brute-forced by super fast computers.</li>\n<li><a href=\"https://www.reddit.com/r/ethereum/comments/45y8m7/brain_wallets_are_now_generally_shunned_by/\" target=\"_blank\" rel=\"noopener noreferrer\">Brain wallets are insecure.</a>.</li>\n<li>Don't use brain wallets.</li>\n</ul>\n<h3>Entropy</h3>\n<ul>\n<li>Also known as \"randomness.\"</li>\n<li>The more random something is, the more entropy it has and the more secure it is.</li>\n<li>Usually defined in \"bits of entropy\" or the number of years it would take to brute-force a <strong>____</strong> (e.g., private key) derived with that much entropy.</li>\n<li>Ethereum private keys are 256-bit keys.</li>\n<li>24-Word mnemonic phrases are also 256 bits of entropy. 2048 words in the dictionary. 11 bits of entropy (the words). <code>11 * 24 = 264</code>. The last word is a checksum.</li>\n</ul>\n<h3>Key Derivation</h3>\n<ul>\n<li>Key derivation functions derive bytes suitable for cryptographic operations from passwords or other data sources using a pseudo-random function (PRF). Different KDFs are suitable for different tasks such as:</li>\n</ul>\n<h4>Cryptographic key derivation</h4>\n<ul>\n<li>Deriving a key suitable for use as input to an encryption algorithm. Typically, this means taking a password and running it through an algorithm such as PBKDF2HMAC or HKDF. This process is typically known as key stretching.</li>\n</ul>\n<h4>Password storage</h4>\n<ul>\n<li>When storing passwords, you want to use an algorithm that is computationally intensive. Legitimate users will only need to compute it once (for example, taking the user’s password, running it through the KDF, then comparing it to the stored value), while attackers will need to do it billions of times. Ideal password storage KDFs will be demanding on both computational and memory resources.</li>\n<li><em>taken from cryptography.io</em> - <a href=\"https://cryptography.io/en/latest/hazmat/primitives/key-derivation-functions/\" target=\"_blank\" rel=\"noopener noreferrer\">Read Full Article</a>.</li>\n</ul>\n<h3>Encryption</h3>\n<ul>\n<li>In its most basic form, encryption is the process of encoding data, making it unintelligible and scrambled. In a lot of cases, encrypted data is also paired with an encryption key, and only those that possess the key will be able to open it.</li>\n<li>An encryption key is a collection of algorithms designed to be totally unique. These are able to scramble and unscramble data, essentially unlocking the information and turning it back to readable data.</li>\n<li>Usually, the person that is encrypting the data will possess the key that locks the data, will make \"copies,\" and will pass them on to relevant people that require access. This process is called public-key cryptography.</li>\n<li><em>taken from techworld.com</em> - <a href=\"https://www.techworld.com/security/what-is-encryption-3659671/\" target=\"_blank\" rel=\"noopener noreferrer\">Read Full Article</a>.</li>\n</ul>\n<h3>Encrypted vs Unencrypted Keys</h3>\n<ul>\n<li>Encrypted Keys require a password or some other type of authorization in order to access the encoded information. MyCrypto encrypts your private key via a Keystore File (UTC/JSON). Unencrypted Keys have been decrypted successfully or have initially not been encrypted.</li>\n</ul>\n<h3>Decentralize / Decentralization</h3>\n<ul>\n<li>The process of transferring authority of a single entity (e.g., a government or large corporation) to multiple smaller entities.</li>\n</ul>\n<h3>Trustless</h3>\n<ul>\n<li>The blockchain produces a distributed, trustless consensus of truth. Since everyone has a copy of the ledger of all transactions ever executed, there is no need for a third party. You can verify the transactions yourself. However, the Ethereum blockchain and Bitcoin blockchain were created to ensure rules and agreements between all parties are executed when all conditions are met.</li>\n</ul>\n<h3>Smart Contracts</h3>\n<ul>\n<li>A piece of code (or program) that is stored on the blockchain network. Conditions of the contract are predefined by the users. If all conditions are met, certain actions are executed by the contract (program).</li>\n<li>These can be executed automatically by the same distributed blockchain that it is stored on.</li>\n<li>These contracts are designed to be tamper-proof and permanent (which includes the code used in their creation). To edit a contract, one would have to create and deploy an entirely new contract.</li>\n</ul>\n<h3>Blockchain</h3>\n<ul>\n<li>A decentralized, publicly-owned ledger.</li>\n<li>It consists of blocks of verified data that are \"stacked\" on top of each other.</li>\n</ul>\n<h3>Block</h3>\n<ul>\n<li>A data structure that contains aggregated transaction data.</li>\n<li>Blocks are cryptographically linked together to form the blockchain (literally, a chain of blocks).</li>\n<li>The first block in a blockchain is called the Genesis Block.</li>\n</ul>\n<h3>Hashing</h3>\n<ul>\n<li>Calculating a function that takes an arbitrary amount of input data and deterministically produces a fixed-length output known as the data's \"hash.\"</li>\n<li>This can be used to verify that data has not been altered. If any part of the input data is changed, the hash will change too.</li>\n</ul>\n<h3>Mining</h3>\n<ul>\n<li>The process by which transactions are verified and added to a proof-of-work blockchain.</li>\n<li>Solving cryptographic problems using high-powered, specialized computing hardware is the actual process that is being completed.</li>\n</ul>\n<h3>Proof-of-Work</h3>\n<ul>\n<li>A system of using computational power to apply a method of security to the consensus of a blockchain (determining the order of blocks in a blockchain).</li>\n<li>Blocks of transactions must be hashed with an additional parameter which takes many tries to create a valid block hash.</li>\n<li>The successfully hashed block is considered a correct and valid proof of computational work.</li>\n<li>An alternative to this system is called proof-of-stake.</li>\n</ul>\n<h3>Proof-of-Stake</h3>\n<ul>\n<li>A system of tying up a validator's economic stake in the network to allow them to have a random chance to propose the next block.</li>\n<li>After a block is proposed, it is then voted on by a pool of validators that each have a certain number of the network's units, and therefore represents a certain amount of the network.</li>\n<li>Benefits of proof-of-stake consensus algorithms include a reduced risk of centralization, improved security, and energy efficiency that leads to decreased environmental effects.</li>\n<li>Casper proof-of-stake is Ethereum's future version of proof-of-stake.</li>\n</ul>\n<h3>Multisignature Address</h3>\n<ul>\n<li>A multisignature (multisig) address allows the address' creator to require multiple parties, using different cryptographic keys to authorize a transaction.</li>\n<li>The exact process of this is defined at the time that the address is created.</li>\n<li>A multisig address might be used because it allows for increased security.</li>\n</ul>\n<h3>Unpermissioned vs Permissioned Ledger</h3>\n<ul>\n<li>Unpermissioned Ledgers (like the Bitcoin blockchain) have no single owner, and any number of people can operate on them and store a copy of them.</li>\n<li>Permissioned Ledgers, on the other hand, may have a single owner, and may also have a limited number of parties with the ability to read or write data to them.</li>\n</ul>\n<h3>Pseudonymous</h3>\n<ul>\n<li>Writing under a fake name. In this case, we are signing transactions under an \"alias,\" which is our private key.</li>\n</ul>\n<h3>Token</h3>\n<ul>\n<li>A digital asset that exists on a blockchain but is not the main cryptocurrency of that blockchain. Examples of tokens that exist on the Ethereum blockchain are BAT, DAI, and OMG. </li>\n<li>Different tokens have different functions, such as storing value, representing a vote, or many others that are being created all the time.</li>\n</ul>\n<h4>Security Token</h4>\n<ul>\n<li>A token that represents a level of investment in a project, often bought/distributed through an inittal coin offering (ICO). In the US, the Securities and Exchange Commission defines something as a security based on the Howey Test, meaning it is a representation of an investment of money in a common enterprise that the investor hopes to profit from.</li>\n</ul>\n<h4>Utility Token</h4>\n<ul>\n<li>A token that is used to interact with a product or service. Filecoin is built on top of the InterPlanetary File System (IPFS), and uses its Filecoin token to pay users who offer storage space to the decentralized storage network. Votem hopes its VAST token can be used to “enable citizens around the world to easily vote online and from their mobile devices with an unprecedented level of verifiability, accessibility, security, and transparency.”</li>\n</ul>\n<h4>Non-Fungible Token (NFT)</h4>\n<ul>\n<li>When something is non-fungible, it means that it is unique and cannot be interchanged with another of it’s kind. Pennies minted in 2019 are fungible because one holds the exact same value to someone as another. So too is Ether. Baseball cards are non-fungible because a low-performing rookie from this year will not hold the same value as a 1952 Micky Mantle. Collectables like CryptoKitties are non-fungible. Another potential use for NFTs would be to prove authenticity and/or ownership of valuables (like art) and property.</li>\n</ul>\n<h3>Stablecoin</h3>\n<ul>\n<li>A digital asset that’s value is pegged to another currency (fiat or digital). This pegging of value is intended to combat volatility. In theory, 1 Dai will always be worth $1 (however, at the time of writing, CoinMarketCap lists the value of 1 Dai to be $1.01).</li>\n</ul>\n<h3>Ethereum vs. Ether</h3>\n<ul>\n<li>Ethereum is the name of the network (blockchain) that Ether runs on. Ether (or ETH) refers to the cryptocurrency that runs on the Ethereum network. These two terms are commonly (incorrectly) used interchangeably.</li>\n</ul>\n<p>All feedback, rewrites, clarification, typo fixing, and requests for additions are more than welcome!</p>"}}},"pageContext":{"slug":"general-knowledge/ethereum-blockchain/a-glossary-of-common-terms-in-the-ethereum-crypto-space","file":"general-knowledge/ethereum-blockchain/a-glossary-of-common-terms-in-the-ethereum-crypto-space.md"}}