{"data":{"site":{"siteMetadata":{"title":"MyCrypto Knowledge Base"}},"category":{"title":"How to Stay Safe","slug":"staying-safe","description":"Learn how to protect yourself and your cryptocurrency.","childrenCategory":[{"title":"Common Scams","slug":"staying-safe/common-scams","description":"TODO"}],"breadcrumbs":[{"title":"How to Stay Safe","slug":"staying-safe"}]},"allCategory":{"edges":[{"node":{"title":"Common Scams","slug":"staying-safe/common-scams","description":"TODO","childrenPage":[{"title":"Overview of Common Scams"},{"title":"Hardware Wallet Scams and Hacks"},{"title":"Malicious Software"},{"title":"Phishing Scams and Hacks"},{"title":"Privacy Concerns"}]}}]},"allPage":{"edges":[{"node":{"title":"How to stay safe during ICOs and other periods","slug":"staying-safe/how-to-stay-safe","excerpt":" Domain verification The problem There are many website clones of ICOs with fake contribution addresses. Sometimes they use character substitutions in the domain (e.g., an \"i\" becomes an \"l\" in the ..."}},{"node":{"title":"How Can We Trust MyCrypto?","slug":"staying-safe/how-can-we-trust-mycrypto","excerpt":" The quickest answer is: Luckily, you don't have to trust us! You can run us offline. You can use a hardware wallet. These both ensure that your keys never touch an internet-connected device, which ..."}},{"node":{"title":"How to avoid getting scammed and phished","slug":"staying-safe/mycrypto-protips-how-not-to-get-scammed-during-ico","excerpt":" Below are some tips to reduce the risk of losing your hard-earned coins Install EtherSecurityLookup if you use Twitter, and either EtherAddressLookup or MetaMask if you use MyCrypto or other crypto-..."}},{"node":{"title":"Ensuring MyCrypto Doesn't Give Different People the Same Private Key","slug":"staying-safe/ethereum-two-people-same-private-key","excerpt":" \"How does Ethereum ensure that two people aren't given the same key?\" First of all, a wallet's private key is not given, it is randomly generated. Then the public key is derived from it and, finally..."}},{"node":{"title":"Couldn't Everybody Type in Random Private Keys and Steal Funds?","slug":"staying-safe/couldnt-everybody-put-in-a-random-key-and-send-to-own-address","excerpt":" Short Version Yes, but finding an account with a balance would take eons ... so ... no. Long Version Ethereum is based on Public Key Cryptography, specifically Elliptic Curve Cryptography, which i..."}},{"node":{"title":"Advanced: Creating a Secure Wallet by Tomshwom","slug":"staying-safe/advanced-secure-wallets-by-tomshwom","excerpt":" Preface This is the updated version of the original post on Steemit here. By /u/AtLeastSignificant. Purpose In this guide, we are going to create a customizable wallet solution that is cheap, sec..."}},{"node":{"title":"Securely store & guard your private key by drewshaver","slug":"staying-safe/how-to-securely-store-and-guard-your-private-key","excerpt":" Source: /u/drewshaver Preface This guide assumes that you just received a Trezor and Cryptosteel in the mail. Which hardware wallet you chose is not integral to the guide -- any hardware wallet wil..."}},{"node":{"title":"Can I turn on 2FA for MyCrypto?","slug":"staying-safe/turning-on-2fa-on-mycrypto","excerpt":" No. And if you landed on a site telling you that you could, they are lying to you and trying to steal your private keys. 2FA / MFA is something that works for server-side applications in order to ad..."}},{"node":{"title":"Verifying the authenticity of the desktop application","slug":"staying-safe/verifying-authenticity-of-desktop-app","excerpt":" After downloading the desktop application, it's highly recommended to verify the checksum of the application. This ensures that you are using the real MyCrypto desktop application and not one that ha..."}},{"node":{"title":"How to Help Defeat the Phishers","slug":"staying-safe/call-to-action-help-us-with-phishers-please","excerpt":" These phishers will not stop until they stop getting money or get caught. We don't have the time or manpower to do it all. There are so many things to do and watch and document. We thank you for your..."}},{"node":{"title":"What to Do If Your Funds Are Stolen","slug":"staying-safe/phish-hacks-thefts-and-stolen-funds-due-to-phishing","excerpt":" Victim of a phishing attack? We are sorry this happened Unfortunately, we encounter these phishing scams / attacks on a daily basis. The most common cause for these incidents is entering your privat..."}},{"node":{"title":"Protecting Yourself and Your Funds","slug":"staying-safe/protecting-yourself-and-your-funds","excerpt":" 1. Get yourself a hardware wallet. One of the safest and easiest ways to store your ETH, Tokens, ETC, BTC, and many other coins is via a Ledger Nano S or TREZOR. Both are hardware wallets. Both work..."}},{"node":{"title":"Why you should backup your hardware wallet","slug":"staying-safe/why-you-should-backup-your-hardware-wallet","excerpt":" Preface The following assumes you are using a Ledger Nano S or TREZOR hardware wallet. Due to their ease of use and security, we recommend a hardware wallet for cold storage. To save / backup your ..."}},{"node":{"title":"Hardware Wallet Recommendations","slug":"staying-safe/hardware-wallet-recommendations","excerpt":" One of the safest and easiest ways to store your ETH, tokens, ETC, BTC, and many other coins is via a Ledger Nano S or TREZOR. Both are hardware wallets. Both work with MyCrypto.com and the MyCrypto ..."}}]}},"pageContext":{"slug":"staying-safe"}}