{"data":{"page":{"title":"Can I turn on 2FA for MyCrypto?","slug":"staying-safe/turning-on-2fa-on-mycrypto","originalSlug":"staying-safe/turning-on-2fa-on-mycrypto","description":"Security & Phishing","datePublished":"2017-07-05","dateModified":"2018-12-19","parent":{"__typename":"Category","title":"How to Stay Safe"},"breadcrumbs":[{"title":"How to Stay Safe","slug":"staying-safe"},{"title":"Can I turn on 2FA for MyCrypto?","slug":"staying-safe/turning-on-2fa-on-mycrypto"}]},"file":{"childMarkdownRemark":{"html":"<p>No. And if you landed on a site telling you that you could, they are lying to you and trying to steal your private keys.</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Multi-factor_authentication\" target=\"_blank\" rel=\"noopener noreferrer\">2FA / MFA</a> is something that works for server-side applications in order to add an additional layer of security on top of the username and password.</p>\n<h2>TOPT (Google Authenticator)</h2>\n<blockquote>\n<p>Time-based One-time Password (TOTP), popularized mainly by Google Authenticator, verifies your identity based a secret that must be shared online between you and the provider.</p>\n<p>When logging into a website, your device generates a unique code based on the shared secret and the current time. Then you have to manually submit this code. The server generates the exact same thing, based on the same secret, in order to compare and validate the login request.</p>\n</blockquote>\n<p><img src=\"https://cdn-images-1.medium.com/max/1600/0*nWGWoyFQ_SVN_KnZ.\"></p>\n<p><a href=\"https://blog.trezor.io/why-you-should-never-use-google-authenticator-again-e166d09d4324\" target=\"_blank\" rel=\"noopener noreferrer\"><em>Source</em></a></p>\n<p>All of this work is done so that you are <em>authorized</em> to access the information stored on the servers of the service you are using.</p>\n<h2>The blockchain and MyCrypto</h2>\n<p>In the case of MyCrypto.com, a client-side application, we do not have servers in this fashion. We do not hold your keys on our servers. We do not give you access to the keys on our servers. You have the key. That key is the core piece of information that allows access to authenticate a transaction on the blockchain. While <em>you</em> can encrypt it with a password, there is no server that can verify or track a 2FA login / <a href=\"https://en.wikipedia.org/wiki/One-time_password\" target=\"_blank\" rel=\"noopener noreferrer\">OTP</a> when you are using MyCrypto. If someone gets your private key (Keystore file, mnemonic, passwords), they have complete access to your funds. There is no stopping transactions, canceling transactions, or resetting passwords.</p>\n<p>In order to implement 2FA, we would need to store your key and protect it on our servers. This is simply not something we want to do. If we did so, we would have a situation where anyone who gets access to our servers, your keys, or your 2FA codes gets access to the funds of every user on our servers. The bounty on hacking our servers is as large as the funds held by every user. That's a huge bounty and is dangerous.</p>\n<p>If this is functionality that you do want, feel free to use an exchange or hosted wallet, such as Coinbase, Kraken, Poloniex, Bittrex, Bitfinex, Gemini, and so forth. Just be aware of the risk of letting someone else hold your keys and, in turn, 2FA codes for you.</p>\n<h2>Hardware wallets</h2>\n<p>Or, you know, spend the &#x3C;$100 and get a <a href=\"/staying-safe/hardware-wallet-recommendations\">hardware wallet</a>. It's worth it. You can use it for 2FA on other services and ensure the safety and security of your funds.</p>\n<p>More information: <a href=\"https://github.com/kvhnuke/etherwallet/issues/292\" target=\"_blank\" rel=\"noopener noreferrer\">https://github.com/kvhnuke/etherwallet/issues/292</a></p>\n<h2>Related articles</h2>\n<ul>\n<li><a href=\"/staying-safe\">Security &#x26; Phishing</a></li>\n<li><a href=\"/general-knowledge/about-mycrypto/whats-the-difference-between-an-exchange-and-mycrypto\">What is the Difference between an Exchange and MyCrypto?</a></li>\n</ul>"}}},"pageContext":{"slug":"staying-safe/turning-on-2fa-on-mycrypto","file":"staying-safe/turning-on-2fa-on-mycrypto.md"}}