{"data":{"page":{"title":"What's the Difference Between an Exchange and MyCrypto?","slug":"general-knowledge/about-mycrypto/whats-the-difference-between-an-exchange-and-mycrypto","originalSlug":"general-knowledge/about-mycrypto/whats-the-difference-between-an-exchange-and-mycrypto","description":"Getting Started","datePublished":"2015-07-15","dateModified":"2018-12-19","parent":{"__typename":"Category","title":"About MyCrypto"},"breadcrumbs":[{"title":"General Knowledge","slug":"general-knowledge"},{"title":"About MyCrypto","slug":"general-knowledge/about-mycrypto"},{"title":"What's the Difference Between an Exchange and MyCrypto?","slug":"general-knowledge/about-mycrypto/whats-the-difference-between-an-exchange-and-mycrypto"}]},"file":{"childMarkdownRemark":{"html":"<p>\"What is the difference between an exchange (e.g. Coinbase, Kraken, Gemini, Poloniex, Bittrex) and MyCrypto?\"</p>\n<p>Your ETH &#x26; tokens are on the blockchain, regardless of what service you use to access them. When you move them, you are sending them from one address on the blockchain to another. These are simply lines of code. Your wallet file, the user interface you interact with, the private key—these do not have funds in them. The private key gives you the ability to prove ownership over coins that are on the blockchain.</p>\n<p><strong>If you use a client-side tool like MyCrypto or Mist, Metamask, Exodus, or Jaxx,</strong> then you have the private key &#x26; you control your funds and your key. You do not rely on Coinbase or Gemini sending your funds from their account to yours.</p>\n<p>The upside is that you, and only you, control your keys. An exchange getting hacked won't affect you. The downside is that <strong>you, and only you,</strong> control your keys. No one else has them, nor can recover them, should you lose them.</p>\n<p>If you do lose your private key or wallet file or password, you cannot prove ownership of an account and therefore you cannot ever send your coins again.</p>\n<p><strong>If you use an exchange like Coinbase, Gemini, Kraken, Polonix, Bittrex,</strong> then you have any account with that company, and they hold your ETH and your keys for you. They have their own account on the blockchain with all their and their customers' funds in it. Then you have a username / password with them, on their servers, and they keep track of how much ETH they \"owe\" you.</p>\n<p>This allows you to have the more traditional username / password situation and do things like reset your password if you forget it, change your password if your password is compromised, and turn on 2FA. However, it also means that if the exchange loses ETH, it's <strong>your ETH that is lost.</strong></p>\n<p><strong>If you choose to move from an exchange to a wallet where you control your keys,</strong> you need to make sure that you have multiple backups, stored in separate locations, of your private key + password. This will prevent loss in case your computer crashes or your house burns down or anything else.</p>\n<p>You also need to ensure you keep these keys securely. This means:</p>\n<ul>\n<li>Don't enter it on random websites</li>\n<li>Always ensure you are on the correct site or downloading from the legitimate repo / website.</li>\n<li>Don't email your key,  send it to anyone or post it online</li>\n<li>Don't save it to cloud storage</li>\n<li>Don't have Team Viewer or other remote access software on your computer</li>\n</ul>\n<p>If this seems very overwhelming, <a href=\"/staying-safe/hardware-wallet-recommendations\">>we recommend purchasing a Ledger or TREZOR hardware wallet</a>. These help keep your keys safe and stored in an \"offline\" device, rather than on your computer. In this case, you don't have to worry about files or strings of characters; instead you just connect your hardware wallet to your computer.</p>"}}},"pageContext":{"slug":"general-knowledge/about-mycrypto/whats-the-difference-between-an-exchange-and-mycrypto","file":"general-knowledge/about-mycrypto/whats-the-difference-between-an-exchange-and-mycrypto.md"}}