{"data":{"page":{"title":"Investing Responsibly (by Brian Armstrong / Coinbase)","slug":"general-knowledge/investing-icos-tokens/investing-responsibly-by-brian-armstrong-coinbase","originalSlug":"general-knowledge/investing-icos-tokens/investing-responsibly-by-brian-armstrong-coinbase","description":"Best Of","datePublished":"2017-12-09","dateModified":"2017-12-09","parent":{"__typename":"Category","title":"Investing, ICOs & Tokens"},"breadcrumbs":[{"title":"General Knowledge","slug":"general-knowledge"},{"title":"Investing, ICOs & Tokens","slug":"general-knowledge/investing-icos-tokens"},{"title":"Investing Responsibly (by Brian Armstrong / Coinbase)","slug":"general-knowledge/investing-icos-tokens/investing-responsibly-by-brian-armstrong-coinbase"}]},"file":{"childMarkdownRemark":{"html":"<h2>Please invest responsibly</h2>\n<p>We at Coinbase couldn’t be more excited by the explosion of interest in digital currencies. The last few weeks has seen an unprecedented increase in the price of digital currencies. More people are engaging with our platform than ever and that bodes well for the future of the digital currency. At the same time, it does create extreme volatility and stress on our systems. We take this very seriously and wanted to share some important thoughts.</p>\n<h2>We’re continuing to invest heavily to scale our platform</h2>\n<p>Over the course of this year we have invested significant resources to increase trading capacity on our platform and maintain availability of our service. We have increased the size of our support team by 640% and launched phone support in September. We have also invested heavily in our infrastructure and have increased the number of transactions we are processing during peak hours by over 40x.</p>\n<h2>There may be downtime which can impact your ability to trade</h2>\n<p>Despite the sizable and ongoing increases in our technical infrastructure and engineering staff, we wanted to remind customers that access to Coinbase services may become degraded or unavailable during times of significant volatility or volume. This could result in the inability to buy or sell for periods of time. Despite ongoing increases in our support capacity, our customer support response times may be delayed, especially for requests that do not involve immediate risks to customer account security. You can read more in our Coinbase User Agreement.</p>\n<h2>Be an educated investor</h2>\n<p>We also wanted to remind customers of some of the risks associated with trading digital currency. Digital currencies are volatile and the prices can go up and down. Due to the rapidly changing price of digital currencies, some customers may not have sell limits that are sufficient relative to the value of total digital currency they are storing on Coinbase. Sell limits are one of the many measures Coinbase takes to protect client accounts and assets.</p>\n<p>As a proactive measure, we encourage customers to check the following items on their accounts:</p>\n<ol>\n<li>Ensure your email address is properly receiving all communications and notifications from Coinbase. To learn more about ensuring email delivery, please refer to this support article.</li>\n<li>Ensure your two-factor authentication is updated and functional. If you have recently switched mobile devices, your two-factor authentication needs to be properly migrated to the new device. In addition, please migrate from SMS two factor to Google Authenticator to enhance the security on your account, if you have not already done so. To learn more about two-factor authentication, please refer to this FAQ.</li>\n<li>Familiarize yourself with your buy and sell limits. They can be found here.</li>\n<li>Complete any pending identity verifications. During times of significant volatility, ID verification may become degraded or unavailable. To learn more about identity verification on Coinbase, please refer to this FAQ.</li>\n<li>Expect payments to take the maximum number of days indicated when making a deposit or withdrawal.</li>\n</ol>\n<h2>Stay up to date</h2>\n<p>We will continue to update customers on our website, our status page, in our apps, via email, on our blog and on Twitter.</p>\n<h3>We will keep you informed</h3>\n<p>We are committed to safety, security and transparency. We are working tirelessly to provide the best service and support but we can’t promise perfection during the periods of extraordinary demand. We will continue to do our best to keep our customers informed.</p>\n<hr>\n<h2>Related articles</h2>\n<ul>\n<li><a href=\"https://buynhodl.com/ether-investor-focus-olaf-carlson-wee-polychain-capital/\" target=\"_blank\" rel=\"noopener noreferrer\">https://buynhodl.com/ether-investor-focus-olaf-carlson-wee-polychain-capital/</a> -- the video is gone but the notes are still great.</li>\n</ul>\n<hr>\n<h2>Source</h2>\n<ul>\n<li><a href=\"https://blog.coinbase.com/please-invest-responsibly-an-important-message-from-the-coinbase-team-bf7f13a4b0b1\" target=\"_blank\" rel=\"noopener noreferrer\">https://blog.coinbase.com/please-invest-responsibly-an-important-message-from-the-coinbase-team-bf7f13a4b0b1</a></li>\n</ul>"}}},"pageContext":{"slug":"general-knowledge/investing-icos-tokens/investing-responsibly-by-brian-armstrong-coinbase","file":"general-knowledge/investing-icos-tokens/investing-responsibly-by-brian-armstrong-coinbase.md"}}