{"data":{"page":{"title":"How to create a wallet","slug":"how-to/getting-started/how-to-create-a-wallet","originalSlug":"how-to/getting-started/how-to-create-a-wallet","description":"Getting Started","datePublished":"2015-10-05","dateModified":"2018-12-19","parent":{"__typename":"Category","title":"Getting Started"},"breadcrumbs":[{"title":"How-To Guides","slug":"how-to"},{"title":"Getting Started","slug":"how-to/getting-started"},{"title":"How to create a wallet","slug":"how-to/getting-started/how-to-create-a-wallet"}]},"file":{"childMarkdownRemark":{"html":"<h2>Preface</h2>\n<p>We highly recommend getting a hardware wallet or using MetaMask as a method to access your wallet and store your funds.</p>\n<p>The following assumes you are <strong>not</strong> using a hardware wallet or MetaMask. Due to their ease of use and security, <a href=\"/staying-safe/hardware-wallet-recommendations\">we recommend a hardware wallet for cold storage</a>.</p>\n<p>Remember to back up any wallets you create! Including the 12-word or 24-word private seed phrase for your hardware wallets! MyCrypto <em>CANNOT</em> recover any lost passwords or access accounts. MyCrypto only has access to information that is publicly available on the blockchain. The security and responsibilty of your funds rests on your own shoulders! But MyCrypto will always be here for guidance and to answer any questions that you may have regarding how to be safe with your funds.  </p>\n<h2>How To Create a New Wallet</h2>\n<ul>\n<li>Go to <a href=\"https://mycrypto.com/generate\" target=\"_blank\" rel=\"noopener noreferrer\">https://mycrypto.com/generate</a>.</li>\n</ul>\n<p><img src=\"https://i.imgur.com/N7xEOtS.png\"></p>\n<p>If you do not choose to use a hardware wallet, MetaMask, or Parity Signer, then we recommend to use MyCrypto desktop app. The desktop app is available for Mac, Windows, Linux or as a standalone app.</p>\n<ul>\n<li><a href=\"https://download.mycrypto.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Download the MyCrypto Desktop App</a></li>\n</ul>\n<p>Once you have downloaded and successfully installed the app, open the app from your applications folder. This should open the MyCrypto Desktop interface.</p>\n<p><img src=\"https://i.imgur.com/dlXS2Xd.png\"></p>\n<ul>\n<li>Click \"Create New Wallet\" in the side navigation bar. This will bring up three options.</li>\n</ul>\n<p><img src=\"https://i.imgur.com/xFEwshp.png\"></p>\n<ul>\n<li>Select an option for a type of wallet to create. In this case, click \"Generate a Wallet\" in the \"Create New Wallet\" box.</li>\n</ul>\n<p><img src=\"https://i.imgur.com/1JgaeHB.png\"></p>\n<h3>Generate a keystore file</h3>\n<ol>\n<li>\n<p>Enter a strong password. Using a randomly-generated password is recommended. Make sure that you write this password down on multiple pieces of paper! Place the paper somewhere safe!</p>\n<ul>\n<li>You can also create a text file on a USB and save your password there.</li>\n<li>*This password encrypts (protects) your private key. It does not generate your private key. This password alone will <strong>not</strong> be enough to access your Ether.*</li>\n</ul>\n</li>\n<li>\n<p>Enter the password again to confirm it.</p>\n</li>\n<li>\n<p>Click the <code>\"Create New Wallet\"</code> button.</p>\n</li>\n<li>\n<p>Download your <code>Keystore File</code>:</p>\n<ul>\n<li>Save this file to a USB drive.</li>\n<li><em>This is the encrypted version of your private key. You need the password to access it. It is safer than your unencrypted private key but you must have your password to access it in the future.</em></li>\n</ul>\n</li>\n<li>\n<p>Read the warning. If you understand it, click the <code>\"Continue\"</code> button.</p>\n</li>\n<li>\n<p>Print your paper wallet backup.</p>\n</li>\n<li>\n<p>Print out the current page to save your private key by using your web browser's print option.</p>\n<ul>\n<li>You can write it out by hand, but it is not recommended. <em>If you do choose to write it down, it is recommended you write it 2 or 3 times. This decreases the chance your messy handwriting will prevent you from accessing your wallet later.</em></li>\n</ul>\n</li>\n<li>\n<p>Copy &#x26; paste your address into a text document and save it.</p>\n<ul>\n<li><em>Search your address on <a href=\"https://etherscan.io/\" target=\"_blank\" rel=\"noopener noreferrer\">Etherscan</a>. Bookmark this page. This is how you will view your balance at any time</em>.</li>\n</ul>\n</li>\n</ol>\n<h3>Mnemonic phrase</h3>\n<ol>\n<li>\n<p>Click the <code>\"Generate a Mnemonic Phrase\"</code> button.</p>\n</li>\n<li>\n<p>You can click \"Regenerate Phrase\" as many times as you want until you get a set of words that you like.</p>\n</li>\n<li>\n<p>Write down the 12-word phrase that you have listed.</p>\n</li>\n<li>\n<p>Click the <code>\"Confirm Phrase\"</code> button.</p>\n</li>\n<li>\n<p>Click the words on your phrase in order.</p>\n<ul>\n<li>This is to double check that you wrote down your 12-word phrase correctly.</li>\n</ul>\n</li>\n</ol>\n<p>Congratulations! You've successfully created a wallet!</p>\n<h2>Things to double check</h2>\n<ul>\n<li>\n<p>Unlock your new wallet using the method you chose to generate your wallet: Keystore File or Mnemonic Phrase.  Ensure it unlocks the wallet you generated and that the address matches the one you bookmarked.</p>\n<ul>\n<li><em>Do not simply leave your new wallet open. Pretend you are coming back a year later to access your riches. Can you do it?</em></li>\n</ul>\n</li>\n<li>\n<p>Send a small amount of Ether (0.0001 ETH) from your previous wallet or exchange to your new wallet's public address (the one beginning with '0x').</p>\n</li>\n<li>\n<p>Send a small amount of Ether (0.00001 ETH) from this new wallet to another address.</p>\n<ul>\n<li><em>Perhaps our donation address? We are a free, open-source service. There are no fees, no ads, no tracking, no cookies, no selling your data.</em></li>\n</ul>\n</li>\n<li>\n<p>Ensure you have recorded all necessary bits of information and the addresses match at all times. If they don't, you miswrote something somewhere. That means it's time to start from the beginning in order to make sure you never lose access to your funds.</p>\n</li>\n</ul>\n<p>Doing all of this is tedious, but it ensures (1) you have complete access to your funds, (2) the address you sent to is correct and matches the private key you have saved, and (3) you can rest easily for years to come, knowing you will be able to access your ETH later.</p>\n<h3>Safe storage of backups</h3>\n<p>It is recommended that you store backups of both forms of your key (the Keystore or Mnemonic Phrase and paper wallet version) in physically separate, offline environments.</p>\n<p>This prevents loss of the private key and password due to a dead hard drive, lost USB drive, wet piece of paper, etc. Keep in mind that physical loss can affect an entire geographical area (e.g., fire, flood).</p>\n<h3>MyCrypto cannot recover your key</h3>\n<p>MyCrypto is not a web wallet and cannot recover your private key or password, access your account, move funds, recover funds, nor cancel/reverse transactions.</p>\n<p>We are a client-side interface that allows you to interact with the Ethereum blockchain. Please secure and back up your key like the millions of dollars it could someday be worth.</p>\n<h2>Related articles</h2>\n<ul>\n<li><a href=\"/general-knowledge/ethereum-blockchain/difference-between-wallet-types\">What is the difference between private key &#x26; Keystore / UTC file?</a></li>\n<li><a href=\"/staying-safe/protecting-yourself-and-your-funds\">Protecting yourself and your funds</a></li>\n</ul>"}}},"pageContext":{"slug":"how-to/getting-started/how-to-create-a-wallet","file":"how-to/getting-started/how-to-create-a-wallet.md"}}