{"data":{"page":{"title":"Hardware Wallet Recommendations","slug":"staying-safe/hardware-wallet-recommendations","originalSlug":"staying-safe/hardware-wallet-recommendations","description":"Hardware Wallets","datePublished":"2015-07-15","dateModified":"2018-11-29","parent":{"__typename":"Category","title":"How to Stay Safe"},"breadcrumbs":[{"title":"How to Stay Safe","slug":"staying-safe"},{"title":"Hardware Wallet Recommendations","slug":"staying-safe/hardware-wallet-recommendations"}]},"file":{"childMarkdownRemark":{"html":"<p>One of the safest and easiest ways to store your ETH, tokens, ETC, BTC, and many other coins is via a <strong>Ledger Nano S</strong> or <strong>TREZOR</strong>. Both are hardware wallets. Both work with MyCrypto.com and the MyCrypto <a href=\"https://download.mycrypto.com/\" target=\"_blank\" rel=\"noopener noreferrer\">desktop application</a>.</p>\n<ul>\n<li><a href=\"https://www.ledgerwallet.com/r/1985?path=/products/\" target=\"_blank\" rel=\"noopener noreferrer\">Buy a Ledger</a></li>\n<li><a href=\"https://shop.trezor.io/?offer_id=10&#x26;aff_id=1735\" target=\"_blank\" rel=\"noopener noreferrer\">Buy a Trezor</a></li>\n<li><a href=\"http://keepkey.go2cloud.org/aff_c?offer_id=1&#x26;aff_id=4086\" target=\"_blank\" rel=\"noopener noreferrer\">Buy a Keepkey</a></li>\n</ul>\n<h2>Why do you need a hardware wallet?</h2>\n<p>In theory, as long as you keep backups of your keys, don't visit any malicious / phishing sites, never use remote access software, and don't install any malicious applications, you <em>should</em> be fine. However, we hear from folks every day who lose, misplace, destroy, or are robbed of their private keys. It only takes one mistake to lose everything.</p>\n<p>The hardware options give you peace of mind, are easy-to-use, and are becoming a must-have for anyone storing more funds than they are willing to lose. We recommend this storage method to anyone holding anything over two weeks' worth of salary.</p>\n<p>The device itself holds the keys and signs transactions for you. MyCrypto is integrated with both Ledger and TREZOR, so you can even use the same interface you are already familiar with. This ensures your keys aren't ever on any internet-connected device. Phishers can't get them. Malware can't get them. Keyloggers can't get them.</p>\n<p>When you set up the device, you will write down your key (24-word backup phrase) and store it offline in a secure secondary location. This prevents you from losing access to your funds if something were to happen to your hardware wallet.</p>"}}},"pageContext":{"slug":"staying-safe/hardware-wallet-recommendations","file":"staying-safe/hardware-wallet-recommendations.md"}}