{"data":{"page":{"title":"How Can I Help Contribute Code?","slug":"developers/contributing-code","originalSlug":"developers/contributing-code","description":"Contributor Info","datePublished":"2017-10-08","dateModified":"2018-11-29","parent":{"__typename":"Category","title":"For Developers / Contributors"},"breadcrumbs":[{"title":"For Developers / Contributors","slug":"developers"},{"title":"How Can I Help Contribute Code?","slug":"developers/contributing-code"}]},"file":{"childMarkdownRemark":{"html":"<p>If you're a developer looking to pitch in, you're more than welcome to help out. Here are some suggestions for diving in:</p>\n<h2>Read the Documentation</h2>\n<p>Make sure you read the entire Readme to understand some basics about the project and how to run it. You can also check out our <a href=\"https://github.com/MyCryptoHQ/MyCrypto/wiki/Style-Guides\" target=\"_blank\" rel=\"noopener noreferrer\">style guide</a> for how to write code that matches the way we write things.</p>\n<h2>Find a Good First Issue</h2>\n<p>If this is your first time contributing to MyCrypto, you'd probably do well to start small. We often mark good tasks for this on our issue queue with the \"good first issue\" label. <a href=\"https://github.com/MyCryptoHQ/mycrypto/issues?q=is%3Aopen+is%3Aissue+label%3A%22good+first+issue%22\" target=\"_blank\" rel=\"noopener noreferrer\">You can find those over here</a>.</p>\n<h2>Make an Issue First</h2>\n<p>Before you dive into coding your change, it's often a good idea to first make an issue or work on an existing issue before you start. This will allow anyone to provide feedback about what you're going to work on before you spend time on something that may change. Likewise, it will prevent someone else from working on the same issue as you. Pull requests against an existing issue have a much higher chance of getting merged.</p>\n<h2>Write Unit Tests</h2>\n<p>If your changes touch the more structural parts of the codebase, you'll be asked to write tests for them, and make sure the existing tests pass. Detailed documentation of writing and running tests is forthcoming, but for now, just try to follow the example of existing tests.</p>\n<h2>Make a Detailed Pull Request</h2>\n<p>Make sure you follow the format of a new pull request where applicable. </p>\n<p>You'll want to:</p>\n<ol>\n<li>Provide a detailed explanation for what your code does.</li>\n<li>List all of the high-level technical changes you've made.</li>\n<li>Provide a list of steps for testing your change (if applicable).</li>\n<li>Provide screenshots / gifs of the visual changes (if applicable).</li>\n<li>Pull requests that have the above information are much more likely to be accepted.</li>\n</ol>"}}},"pageContext":{"slug":"developers/contributing-code","file":"developers/contributing-code.md"}}