{"data":{"page":{"title":"How To Send A Transaction","slug":"how-to/sending/how-to-send-a-transaction","originalSlug":"how-to/sending/how-to-send-a-transaction","description":"Sending & Receiving","datePublished":"2017-07-05","dateModified":"2018-12-19","parent":{"__typename":"Category","title":"Sending"},"breadcrumbs":[{"title":"How-To Guides","slug":"how-to"},{"title":"Sending","slug":"how-to/sending"},{"title":"How To Send A Transaction","slug":"how-to/sending/how-to-send-a-transaction"}]},"file":{"childMarkdownRemark":{"html":"<p>If you plan to move a large amount of Ether or tokens, you should first send a test transaction of a small amount to the destination wallet to ensure everything goes as planned.\nOptional, but <strong>highly recommended</strong> (if you haven't already): Install <a href=\"/how-to/migrating/moving-from-mycrypto-to-metamask\">MetaMask</a> or the <a href=\"https://chrome.google.com/webstore/detail/etheraddresslookup/pdknmigbbbhmllnmgdfalmedcmcefdfn?hl=en-GB\" target=\"_blank\" rel=\"noopener noreferrer\">EtherAddressLookup Chrome Extension</a> to protect yourself from malicious websites around the crypto-space that will steal your private keys. Or even better, think about getting yourself a hardware wallet. If you have hundreds or thousands of dollars online, you might as well spend a little bit more money to ensure that your funds are safe.</p>\n<ol>\n<li>\n<p>Navigate to the [Send] page (<a href=\"https://mycrypto.com/account\" target=\"_blank\" rel=\"noopener noreferrer\">https://mycrypto.com/account</a>).</p>\n</li>\n<li>\n<p>Select how you would like to <a href=\"/how-to/accessing-wallet/how-to-access-your-wallet-with-keystore-file\">access your wallet and unlock it</a>.</p>\n</li>\n<li>\n<p>If you installed MetaMask earlier, set up your system to unlock your wallet safely in just one click. Because of how fast and easy it is, we strongly recommend this method.</p>\n</li>\n<li>\n<p>Enter the address you would like to send to in the \"To Address:\" field.</p>\n</li>\n<li>\n<p>If you're sending ETH, move on the step 6. If you are sending a token, select which one you want to send. If the token of your choice is not listed:</p>\n<ol>\n<li>In the sidebar, click <a href=\"/troubleshooting/tokens/adding-new-token-and-sending-custom-tokens\">Add Custom Token</a>.</li>\n<li>Enter the address, name, and decimals of the token. These are provided by the developers of the token and are also found on <a href=\"https://ethplorer.io/\" target=\"_blank\" rel=\"noopener noreferrer\">Ethplorer</a>.</li>\n<li>Click \"Save.\"</li>\n<li>You can now send that token as well as see it's balance in the sidebar.</li>\n</ol>\n</li>\n<li>\n<p>Enter the amount you would like to send.</p>\n</li>\n<li>\n<p>You can also click the \"Send Entire Balance\" link if you would like the transfer the entire balance.</p>\n</li>\n<li>\n<p>Click \"Generate Transaction.\" A couple more fields will appear. This is your browser generating the transaction.</p>\n</li>\n<li>\n<p>Click the blue \"Send Transaction\" button below that. A pop-up will appear. Double-check that the amount, the type of coin, and the address are correct.</p>\n</li>\n<li>\n<p>Click \"Yes, I am sure! Make transaction\" button. The transaction will be submitted. The TX ID will display. You can click that TX ID to see it on the blockchain.</p>\n</li>\n</ol>\n<p>Just as a reminder, any transaction that you make will require gas which is paid in Ether. It is a transaction fee that is paid to the miners as an incentive to include your transactions in the blocks that they mine.</p>\n<p>For more information about gas, <a href=\"/general-knowledge/ethereum-blockchain/what-is-gas\">please click here</a>.</p>\n<p>During busy network times, <a href=\"/troubleshooting/sending/transactions-not-showing-or-pending\">please read here for more information</a> as to why your transaction is taking forever to get broadcasted onto the network.</p>"}}},"pageContext":{"slug":"how-to/sending/how-to-send-a-transaction","file":"how-to/sending/how-to-send-a-transaction.md"}}