{"data":{"page":{"title":"How to Schedule a Transaction","slug":"how-to/sending/how-to-schedule-a-transaction","originalSlug":"how-to/sending/how-to-schedule-a-transaction","description":"Transactions","datePublished":"2018-09-13","dateModified":"2018-12-19","parent":{"__typename":"Category","title":"Sending"},"breadcrumbs":[{"title":"How-To Guides","slug":"how-to"},{"title":"Sending","slug":"how-to/sending"},{"title":"How to Schedule a Transaction","slug":"how-to/sending/how-to-schedule-a-transaction"}]},"file":{"childMarkdownRemark":{"html":"<p>It is now possible to schedule transactions to be sent later, powered by the <a href=\"https://www.ethereum-alarm-clock.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Ethereum Alarm Clock</a> project. Simply put, it works by sending your transaction to a \"time node\" which will broadcast the transaction at your specified time. Your computer does not need to be powered on at the scheduled time. For a technical explanation of how it works, please refer to <a href=\"https://ethereum-alarm-clock.readthedocs.io/en/latest/index.html\" target=\"_blank\" rel=\"noopener noreferrer\">the Ethereum Alarm Clock documentation</a>.</p>\n<p>To use this feature, click the \"Send Later\" button on the \"Send Ether &#x26; Tokens\" page.</p>\n<p><img src=\"https://i.imgur.com/oqzfAol.png\"></p>\n<p>Just like a regular transaction, you can set a gas price, gas limit, and optional data, but there are some other fields that you have to fill out as well.</p>\n<p><img src=\"https://i.imgur.com/C2Cyb3l.png\"></p>\n<ul>\n<li><strong>Date &#x26; Time and Timezone</strong>: As the name suggests, these fields are to set at which time your transaction should be sent. (Hint: type in the timezone text box to search!)</li>\n<li><strong>Block Number</strong>: Alternatively, you can specify a block number at which your transaction should be sent.</li>\n<li><strong>Window</strong>: The range (in minutes or blocks) during which your transaction may get executed.</li>\n<li><strong>Time Bounty</strong>: The reward (ETH) the Time Node gets for executing your transaction. A higher time bounty will mean that you pay more, but it's more likely that your transaction gets executed (in time).</li>\n<li><strong>Require Deposit</strong>: The amount of ETH the Time Node has to deposit when 'claiming' your transaction.</li>\n<li><strong>Future Gas Price</strong>: The gas price (GWEI) that the transaction will use when it's executed.</li>\n<li><strong>Future Gas Limit</strong>: The gas limit that the transaction will use when it's executed.</li>\n</ul>\n<p>Please note that the gas limit required for the transaction to <em>schedule</em> a future transaction is different from the future gas limit.</p>\n<p>After filling out all the fields, simply click on \"Schedule transaction\" to schedule your transaction. Note that doing so <strong>does not guarantee</strong> that your transaction will be executed, based on what settings you used.</p>"}}},"pageContext":{"slug":"how-to/sending/how-to-schedule-a-transaction","file":"how-to/sending/how-to-schedule-a-transaction.md"}}