{"data":{"page":{"title":"What is nonce?","slug":"general-knowledge/ethereum-blockchain/what-is-nonce","originalSlug":"general-knowledge/ethereum-blockchain/what-is-nonce","description":"Transactions","datePublished":"2017-07-05","dateModified":"2017-09-26","parent":{"__typename":"Category","title":"The Ethereum Blockchain"},"breadcrumbs":[{"title":"General Knowledge","slug":"general-knowledge"},{"title":"The Ethereum Blockchain","slug":"general-knowledge/ethereum-blockchain"},{"title":"What is nonce?","slug":"general-knowledge/ethereum-blockchain/what-is-nonce"}]},"file":{"childMarkdownRemark":{"html":"<p>In Ethereum, every transaction has a nonce. The nonce is the number of transactions sent from a given address.</p>\n<p>Each time you send a transaction, the nonce increases by <code>1</code>. There are rules about what transactions are valid, and the nonce is used to enforce some of these rules. Specifically:</p>\n<p>*- <strong>Transactions must be in order:</strong> You cannot have a transaction with a nonce of <code>1</code> mined before one with a nonce of <code>0</code>.</p>\n<ul>\n<li><strong>No skipping!</strong> You cannot have a transaction with a nonce of <code>2</code> mined if you have not already sent transactions with a nonce of <code>1</code> and <code>0</code>.</li>\n</ul>\n<h3>Why?</h3>\n<p>This field prevents double-spends, as the nonce is the order in which transactions are sorted. In order for a double-spend to be successful, you typically ...</p>\n<ul>\n<li>Send a transaction to one party</li>\n<li>Wait for it to register</li>\n<li>Collect something in return from this first transaction</li>\n<li>Quickly send another transaction with a high gas price</li>\n<li>Have this second transaction mined first, therefore invalidating what would have been the first transaction</li>\n</ul>\n<p>This is why exchanges wait for you to have a certain number of confirmations before allowing you to trade freshly-deposited funds.</p>\n<h2>With Ethereum, the above is not possible</h2>\n<p>This method of double-spending is not possible on the Ethereum blockchain because each transaction has a nonce included with it. Even if you attempt to do the above, it will not work because the second transaction (nonce of <code>3</code>) cannot be mined before the first transaction (nonce of <code>2</code>).</p>"}}},"pageContext":{"slug":"general-knowledge/ethereum-blockchain/what-is-nonce","file":"general-knowledge/ethereum-blockchain/what-is-nonce.md"}}